{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "signature": {"inputs": {"d_mat_sd:0": {"name": "d_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "l_mat_sd:0": {"name": "l_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dx:0": {"name": "dx:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "val_mat_sd:0": {"name": "val_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "c_mat_sn:0": {"name": "c_mat_sn:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "current:0": {"name": "current:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "u_mat_sd:0": {"name": "u_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/strided_slice_8/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/mul_13/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/mul_15/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/ExpandDims_5/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Sum_3/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/mul_7/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/mul_12/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_3/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice_6/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/strided_slice_4/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/strided_slice_6/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/strided_slice_7/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/ones_like/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/PartitionedCall/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_10/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "c_mat_sn", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "current", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "d_mat_sd", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dx", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "l_mat_sd", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "u_mat_sd", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "val_mat_sd", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "PartitionedCall/Shape", "op": "Shape", "input": ["c_mat_sn"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv", "op": "Mul", "input": ["ConstantFolding/PartitionedCall/truediv_recip", "c_mat_sn"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_5", "op": "ExpandDims", "input": ["d_mat_sd", "PartitionedCall/ExpandDims_5/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_16", "op": "Mul", "input": ["PartitionedCall/mul_15/x", "dx"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_1", "op": "ExpandDims", "input": ["l_mat_sd", "PartitionedCall/ExpandDims_5/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Shape_1", "op": "Shape", "input": ["l_mat_sd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/ExpandDims_4", "op": "ExpandDims", "input": ["u_mat_sd", "PartitionedCall/ExpandDims_5/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_6", "op": "ExpandDims", "input": ["val_mat_sd", "PartitionedCall/ExpandDims_5/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Shape", "PartitionedCall/strided_slice_6/stack", "PartitionedCall/strided_slice_4/stack_1", "PartitionedCall/strided_slice_6/stack"], "attr": {"T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}}}, {"name": "PartitionedCall/ones_like_1/Shape", "op": "Shape", "input": ["PartitionedCall/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Shape_1", "PartitionedCall/strided_slice_6/stack", "PartitionedCall/strided_slice_4/stack_1", "PartitionedCall/strided_slice_6/stack"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/ones/Reshape", "op": "Reshape", "input": ["PartitionedCall/strided_slice", "PartitionedCall/strided_slice_7/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/ones_like_1", "op": "Fill", "input": ["PartitionedCall/ones_like_1/Shape", "PartitionedCall/ones_like/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ones", "op": "Fill", "input": ["PartitionedCall/ones/Reshape", "PartitionedCall/ones_like/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/mul/y", "PartitionedCall/ones"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/mul", "PartitionedCall/while/maximum_iterations"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Shape_2", "op": "Shape", "input": ["PartitionedCall/mul"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Shape_2", "PartitionedCall/strided_slice_6/stack_1", "PartitionedCall/strided_slice_6/stack", "PartitionedCall/strided_slice_6/stack"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/ones_like", "op": "Fill", "input": ["PartitionedCall/Shape_2", "PartitionedCall/ones_like/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/BroadcastTo/shape", "op": "Pack", "input": ["PartitionedCall/strided_slice_2", "PartitionedCall/strided_slice_1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/BroadcastTo", "op": "BroadcastTo", "input": ["PartitionedCall/ExpandDims", "PartitionedCall/BroadcastTo/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/zeros_like", "op": "ZerosLike", "input": ["PartitionedCall/BroadcastTo"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/while", "op": "StatelessWhile", "input": ["PartitionedCall/concat_1/axis", "PartitionedCall/while/maximum_iterations", "PartitionedCall/zeros_like", "PartitionedCall/ones_like", "PartitionedCall/mul", "PartitionedCall/ones_like_1", "l_mat_sd", "PartitionedCall/truediv", "val_mat_sd"], "attr": {"_lower_using_switch_merge": {"b": false}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "cond": {"func": {"name": "__inference_while_cond_4890_5294_frozen"}}, "_num_original_outputs": {"i": "9"}, "parallel_iterations": {"i": "10"}, "_read_only_resource_inputs": {"list": {}}, "output_shapes": {"list": {"shape": [{}, {}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}]}}, "body": {"func": {"name": "__inference_while_body_4891_5272_frozen"}}}}, {"name": "PartitionedCall/ExpandDims_2", "op": "ExpandDims", "input": ["PartitionedCall/while:2", "PartitionedCall/concat_1/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/while:4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_12", "op": "Mul", "input": ["PartitionedCall/mul_12/x", "PartitionedCall/while:4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_3", "op": "RealDiv", "input": ["PartitionedCall/truediv_3/x", "PartitionedCall/while:4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_3", "op": "ExpandDims", "input": ["PartitionedCall/while:5", "PartitionedCall/Sum_3/reduction_indices"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/ExpandDims_1", "PartitionedCall/ExpandDims_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul_12", "PartitionedCall/truediv_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_12", "PartitionedCall/truediv_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_1", "op": "RealDiv", "input": ["PartitionedCall/mul_1", "PartitionedCall/ExpandDims_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_13", "op": "Mul", "input": ["PartitionedCall/mul_13/x", "PartitionedCall/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_10", "op": "Mul", "input": ["PartitionedCall/add", "PartitionedCall/mul_10/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/ExpandDims_5", "PartitionedCall/truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/ExpandDims_4", "PartitionedCall/truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_6", "op": "Mul", "input": ["PartitionedCall/ExpandDims_6", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_4", "op": "Mul", "input": ["PartitionedCall/ExpandDims_6", "PartitionedCall/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_3", "op": "Sum", "input": ["PartitionedCall/mul_6", "PartitionedCall/Sum_3/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/Sum_2", "op": "Sum", "input": ["PartitionedCall/mul_4", "PartitionedCall/Sum_3/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_7", "op": "Mul", "input": ["PartitionedCall/Sum_3", "PartitionedCall/mul_7/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_5", "op": "Mul", "input": ["PartitionedCall/Sum_2", "PartitionedCall/mul_7/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_11", "op": "Mul", "input": ["PartitionedCall/mul_7", "c_mat_sn"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_8", "op": "Mul", "input": ["PartitionedCall/mul_5", "c_mat_sn"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_5", "op": "Sum", "input": ["PartitionedCall/mul_11", "PartitionedCall/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/Sum_4", "op": "Sum", "input": ["PartitionedCall/mul_8", "PartitionedCall/concat_1/axis"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_2", "op": "AddV2", "input": ["PartitionedCall/Sum_5", "PartitionedCall/mul_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_1", "op": "AddV2", "input": ["PartitionedCall/Sum_4", "PartitionedCall/mul_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_6", "op": "StridedSlice", "input": ["PartitionedCall/add_2", "PartitionedCall/strided_slice_6/stack", "PartitionedCall/strided_slice_6/stack_1", "PartitionedCall/strided_slice_6/stack"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "PartitionedCall/strided_slice_7", "op": "StridedSlice", "input": ["PartitionedCall/add_2", "PartitionedCall/strided_slice_7/stack", "PartitionedCall/strided_slice_6/stack_1", "PartitionedCall/strided_slice_6/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/strided_slice_8", "op": "StridedSlice", "input": ["PartitionedCall/add_2", "PartitionedCall/strided_slice_8/stack", "PartitionedCall/strided_slice_7/stack", "PartitionedCall/strided_slice_6/stack"], "attr": {"Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/strided_slice_3", "op": "StridedSlice", "input": ["PartitionedCall/add_2", "PartitionedCall/strided_slice_6/stack_1", "PartitionedCall/strided_slice_6/stack", "PartitionedCall/strided_slice_6/stack"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "PartitionedCall/strided_slice_4", "op": "StridedSlice", "input": ["PartitionedCall/add_2", "PartitionedCall/strided_slice_6/stack", "PartitionedCall/strided_slice_4/stack_1", "PartitionedCall/strided_slice_6/stack"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "PartitionedCall/strided_slice_5", "op": "StridedSlice", "input": ["PartitionedCall/add_2", "PartitionedCall/strided_slice_6/stack_1", "PartitionedCall/strided_slice_7/stack", "PartitionedCall/strided_slice_6/stack"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_15", "op": "Mul", "input": ["PartitionedCall/mul_15/x", "PartitionedCall/strided_slice_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_14", "op": "Mul", "input": ["PartitionedCall/mul_15/x", "PartitionedCall/strided_slice_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_2", "op": "Sub", "input": ["PartitionedCall/mul_15", "PartitionedCall/strided_slice_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_1", "op": "Sub", "input": ["PartitionedCall/mul_14", "PartitionedCall/strided_slice_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/PartitionedCall/concat_1/values_1_const_axis", "op": "Const", "input": ["^PartitionedCall/sub_2"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/PartitionedCall/concat/values_0_const_axis", "op": "Const", "input": ["^PartitionedCall/sub_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/concat_1/values_1", "op": "ExpandDims", "input": ["PartitionedCall/sub_2", "ConstantFolding/PartitionedCall/concat_1/values_1_const_axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/concat/values_0", "op": "ExpandDims", "input": ["PartitionedCall/sub_1", "ConstantFolding/PartitionedCall/concat/values_0_const_axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/concat_1", "op": "ConcatV2", "input": ["PartitionedCall/strided_slice_6", "PartitionedCall/concat_1/values_1", "PartitionedCall/concat_1/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/concat", "op": "ConcatV2", "input": ["PartitionedCall/concat/values_0", "PartitionedCall/strided_slice_5", "PartitionedCall/concat_1/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/sub_3", "op": "Sub", "input": ["PartitionedCall/concat_1", "PartitionedCall/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_4", "op": "RealDiv", "input": ["PartitionedCall/sub_3", "PartitionedCall/mul_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_3", "op": "AddV2", "input": ["PartitionedCall/truediv_4", "current"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_5", "op": "RealDiv", "input": ["PartitionedCall/add_3", "PartitionedCall/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["PartitionedCall/truediv_5"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_while_cond_4890_5294_frozen", "inputArg": [{"name": "while_loop_counter", "type": "DT_INT32"}, {"name": "while_maximum_iterations", "type": "DT_INT32"}, {"name": "placeholder", "type": "DT_FLOAT"}, {"name": "placeholder_1", "type": "DT_FLOAT"}, {"name": "placeholder_2", "type": "DT_FLOAT"}, {"name": "placeholder_3", "type": "DT_FLOAT"}, {"name": "while_cond_4890___redundant_placeholder0", "type": "DT_FLOAT"}, {"name": "while_cond_4890___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "while_cond_4890___redundant_placeholder2", "type": "DT_FLOAT"}], "outputArg": [{"name": "identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "__inference_while_cond_4890_5294_frozen/norm/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "__inference_while_cond_4890_5294_frozen/Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "op": "Square", "input": ["placeholder_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Max", "op": "Max", "input": ["placeholder_2", "__inference_while_cond_4890_5294_frozen/norm/Const:output:0"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "norm/Sum", "op": "Sum", "input": ["norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul:y:0", "__inference_while_cond_4890_5294_frozen/norm/Const:output:0"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "norm/Sqrt", "op": "Sqrt", "input": ["norm/Sum:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "norm/Squeeze", "op": "Squeeze", "input": ["norm/Sqrt:y:0"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {}}}}, {"name": "truediv", "op": "RealDiv", "input": ["norm/Squeeze:output:0", "Max:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Greater", "op": "Greater", "input": ["truediv:z:0", "__inference_while_cond_4890_5294_frozen/Greater/y:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}], "ret": {"identity": "Greater:z:0"}}, {"signature": {"name": "__inference_while_body_4891_5272_frozen", "inputArg": [{"name": "while_loop_counter", "type": "DT_INT32"}, {"name": "while_maximum_iterations", "type": "DT_INT32"}, {"name": "placeholder", "type": "DT_FLOAT"}, {"name": "placeholder_1", "type": "DT_FLOAT"}, {"name": "placeholder_2", "type": "DT_FLOAT"}, {"name": "placeholder_3", "type": "DT_FLOAT"}, {"name": "shape_l_mat_sd_0", "type": "DT_FLOAT"}, {"name": "div_no_nan_truediv_0", "type": "DT_FLOAT"}, {"name": "expanddims_6_val_mat_sd_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "identity", "type": "DT_INT32"}, {"name": "identity_1", "type": "DT_INT32"}, {"name": "identity_2", "type": "DT_FLOAT"}, {"name": "identity_3", "type": "DT_FLOAT"}, {"name": "identity_4", "type": "DT_FLOAT"}, {"name": "identity_5", "type": "DT_FLOAT"}, {"name": "shape_l_mat_sd", "type": "DT_FLOAT"}, {"name": "div_no_nan_truediv", "type": "DT_FLOAT"}, {"name": "expanddims_6_val_mat_sd", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_while_body_4891_5272_frozen/Sum_4/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_while_body_4891_5272_frozen/add_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_4891_5272_frozen/truediv/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_4891_5272_frozen/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_4891_5272_frozen/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "__inference_while_body_4891_5272_frozen/ExpandDims_4/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_4891_5272_frozen/ExpandDims_5/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_4891_5272_frozen/ExpandDims_10/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "pow_1", "op": "Square", "input": ["placeholder_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Log", "op": "Log", "input": ["placeholder_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Shape", "op": "Shape", "input": ["shape_l_mat_sd_0"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "truediv", "op": "RealDiv", "input": ["__inference_while_body_4891_5272_frozen/truediv/x:output:0", "placeholder_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_10", "op": "ExpandDims", "input": ["expanddims_6_val_mat_sd_0", "__inference_while_body_4891_5272_frozen/ExpandDims_10/dim:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "ExpandDims_3", "op": "ExpandDims", "input": ["shape_l_mat_sd_0", "__inference_while_body_4891_5272_frozen/ExpandDims_10/dim:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "add_3", "op": "AddV2", "input": ["__inference_while_body_4891_5272_frozen/ExpandDims_10/dim:output:0", "while_loop_counter"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "truediv_2", "op": "RealDiv", "input": ["__inference_while_body_4891_5272_frozen/truediv/x:output:0", "pow_1:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims", "op": "ExpandDims", "input": ["Log:y:0", "__inference_while_body_4891_5272_frozen/ExpandDims_10/dim:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["Shape:output:0", "__inference_while_body_4891_5272_frozen/strided_slice/stack:output:0", "__inference_while_body_4891_5272_frozen/strided_slice/stack_1:output:0", "__inference_while_body_4891_5272_frozen/strided_slice/stack:output:0"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "pow", "op": "Square", "input": ["ExpandDims_10:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Tile/multiples", "op": "Pack", "input": ["__inference_while_body_4891_5272_frozen/ExpandDims_10/dim:output:0", "strided_slice:output:0"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "Tile", "op": "Tile", "input": ["ExpandDims:output:0", "Tile/multiples:output:0"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Cumsum", "op": "Cumsum", "input": ["Tile:output:0", "__inference_while_body_4891_5272_frozen/ExpandDims_10/dim:output:0"], "attr": {"Tidx": {"type": "DT_INT32"}, "exclusive": {"b": true}, "T": {"type": "DT_FLOAT"}, "reverse": {"b": false}}}, {"name": "Exp", "op": "Exp", "input": ["Cumsum:out:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_4", "op": "ExpandDims", "input": ["Exp:y:0", "__inference_while_body_4891_5272_frozen/ExpandDims_4/dim:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_1", "op": "Mul", "input": ["ExpandDims_3:output:0", "ExpandDims_4:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sum", "op": "Sum", "input": ["mul_1:z:0", "__inference_while_body_4891_5272_frozen/ExpandDims_5/dim:output:0"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "div_no_nan", "op": "DivNoNan", "input": ["div_no_nan_truediv_0", "Sum:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_5", "op": "ExpandDims", "input": ["div_no_nan:z:0", "__inference_while_body_4891_5272_frozen/ExpandDims_5/dim:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "mul_2", "op": "Mul", "input": ["ExpandDims_5:output:0", "mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_6", "op": "Mul", "input": ["ExpandDims_10:output:0", "mul_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_5", "op": "Mul", "input": ["mul_2:z:0", "pow:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sum_4", "op": "Sum", "input": ["mul_6:z:0", "__inference_while_body_4891_5272_frozen/Sum_4/reduction_indices:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Sum_2", "op": "Sum", "input": ["mul_5:z:0", "__inference_while_body_4891_5272_frozen/ExpandDims_5/dim:output:0"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "add", "op": "AddV2", "input": ["Sum_4:output:0", "placeholder_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sum_3", "op": "Sum", "input": ["Sum_2:output:0", "__inference_while_body_4891_5272_frozen/ExpandDims_4/dim:output:0"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "sub", "op": "Sub", "input": ["add:z:0", "truediv:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_1", "op": "RealDiv", "input": ["Sum_3:output:0", "placeholder_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "AddV2", "input": ["__inference_while_body_4891_5272_frozen/add_1/y:output:0", "truediv_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_2", "op": "AddV2", "input": ["add_1:z:0", "truediv_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_3", "op": "RealDiv", "input": ["sub:z:0", "add_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_1", "op": "Sub", "input": ["placeholder_2", "truediv_3:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}], "ret": {"identity_4": "sub_1:z:0", "identity_3": "truediv_3:z:0", "shape_l_mat_sd": "shape_l_mat_sd_0", "identity_1": "while_maximum_iterations", "expanddims_6_val_mat_sd": "expanddims_6_val_mat_sd_0", "identity": "add_3:z:0", "identity_2": "Exp:y:0", "identity_5": "Sum:output:0", "div_no_nan_truediv": "div_no_nan_truediv_0"}}]}, "versions": {"producer": 175, "minConsumer": 12}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/strided_slice_8/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/mul_13/x", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/mul_15/x", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/ExpandDims_5/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/Sum_3/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/mul_7/x", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/mul_12/x", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/truediv_3/x", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/while/maximum_iterations", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/strided_slice_6/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/mul/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/strided_slice_4/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/strided_slice_6/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/strided_slice_7/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/ones_like/Const", "shape": [], "dtype": "float32"}, {"name": "ConstantFolding/PartitionedCall/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/mul_10/x", "shape": [], "dtype": "float32"}, {"name": "ConstantFolding/PartitionedCall/concat_1/values_1_const_axis", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/PartitionedCall/concat/values_0_const_axis", "shape": [], "dtype": "int32"}, {"name": "__inference_while_cond_4890_5294_frozen/norm/Const", "shape": [1], "dtype": "int32"}, {"name": "__inference_while_cond_4890_5294_frozen/Greater/y", "shape": [], "dtype": "float32"}, {"name": "__inference_while_body_4891_5272_frozen/Sum_4/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "__inference_while_body_4891_5272_frozen/add_1/y", "shape": [], "dtype": "float32"}, {"name": "__inference_while_body_4891_5272_frozen/truediv/x", "shape": [], "dtype": "float32"}, {"name": "__inference_while_body_4891_5272_frozen/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "__inference_while_body_4891_5272_frozen/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "__inference_while_body_4891_5272_frozen/ExpandDims_4/dim", "shape": [], "dtype": "int32"}, {"name": "__inference_while_body_4891_5272_frozen/ExpandDims_5/dim", "shape": [], "dtype": "int32"}, {"name": "__inference_while_body_4891_5272_frozen/ExpandDims_10/dim", "shape": [], "dtype": "int32"}]}]}