{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "signature": {"inputs": {"val_mat_sd:0": {"name": "val_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "l_mat_sd:0": {"name": "l_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "c_mat_sn:0": {"name": "c_mat_sn:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/ones/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/ones_like/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/PartitionedCall/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "c_mat_sn", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "l_mat_sd", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "val_mat_sd", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv", "op": "Mul", "input": ["ConstantFolding/PartitionedCall/truediv_recip", "c_mat_sn"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Shape", "op": "Shape", "input": ["PartitionedCall/truediv"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Shape", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/ones/Reshape", "op": "Reshape", "input": ["PartitionedCall/strided_slice", "PartitionedCall/ones/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/ones", "op": "Fill", "input": ["PartitionedCall/ones/Reshape", "PartitionedCall/ones_like/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/mul/y", "PartitionedCall/ones"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ones_like/Shape", "op": "Shape", "input": ["PartitionedCall/mul"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ones_like", "op": "Fill", "input": ["PartitionedCall/ones_like/Shape", "PartitionedCall/ones_like/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/while", "op": "StatelessWhile", "input": ["PartitionedCall/while/loop_counter", "PartitionedCall/while/maximum_iterations", "PartitionedCall/ones_like", "PartitionedCall/mul", "l_mat_sd", "PartitionedCall/truediv", "val_mat_sd"], "attr": {"_num_original_outputs": {"i": "7"}, "_lower_using_switch_merge": {"b": false}, "cond": {"func": {"name": "__inference_while_cond_4687_4880_frozen"}}, "parallel_iterations": {"i": "10"}, "output_shapes": {"list": {"shape": [{}, {}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}]}}, "body": {"func": {"name": "__inference_while_body_4688_4988_frozen"}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "_read_only_resource_inputs": {"list": {}}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/while:3"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_while_body_4688_4988_frozen", "inputArg": [{"name": "while_loop_counter", "type": "DT_INT32"}, {"name": "while_maximum_iterations", "type": "DT_INT32"}, {"name": "placeholder", "type": "DT_FLOAT"}, {"name": "placeholder_1", "type": "DT_FLOAT"}, {"name": "shape_l_mat_sd_0", "type": "DT_FLOAT"}, {"name": "div_no_nan_truediv_0", "type": "DT_FLOAT"}, {"name": "expanddims_6_val_mat_sd_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "identity", "type": "DT_INT32"}, {"name": "identity_1", "type": "DT_INT32"}, {"name": "identity_2", "type": "DT_FLOAT"}, {"name": "identity_3", "type": "DT_FLOAT"}, {"name": "shape_l_mat_sd", "type": "DT_FLOAT"}, {"name": "div_no_nan_truediv", "type": "DT_FLOAT"}, {"name": "expanddims_6_val_mat_sd", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_while_body_4688_4988_frozen/Sum_4/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_while_body_4688_4988_frozen/add_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_4688_4988_frozen/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "__inference_while_body_4688_4988_frozen/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_4688_4988_frozen/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_4688_4988_frozen/ExpandDims_4/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_while_body_4688_4988_frozen/truediv/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_4688_4988_frozen/ExpandDims_10/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Log", "op": "Log", "input": ["placeholder_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_1", "op": "Square", "input": ["placeholder_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Shape", "op": "Shape", "input": ["shape_l_mat_sd_0"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "truediv", "op": "RealDiv", "input": ["__inference_while_body_4688_4988_frozen/truediv/x:output:0", "placeholder_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_10", "op": "ExpandDims", "input": ["expanddims_6_val_mat_sd_0", "__inference_while_body_4688_4988_frozen/ExpandDims_10/dim:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "ExpandDims_3", "op": "ExpandDims", "input": ["shape_l_mat_sd_0", "__inference_while_body_4688_4988_frozen/ExpandDims_10/dim:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "add_3", "op": "AddV2", "input": ["__inference_while_body_4688_4988_frozen/ExpandDims_10/dim:output:0", "while_loop_counter"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ExpandDims", "op": "ExpandDims", "input": ["Log:y:0", "__inference_while_body_4688_4988_frozen/ExpandDims_10/dim:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "truediv_2", "op": "RealDiv", "input": ["__inference_while_body_4688_4988_frozen/truediv/x:output:0", "pow_1:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["Shape:output:0", "__inference_while_body_4688_4988_frozen/strided_slice/stack:output:0", "__inference_while_body_4688_4988_frozen/strided_slice/stack_1:output:0", "__inference_while_body_4688_4988_frozen/strided_slice/stack:output:0"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "pow", "op": "Square", "input": ["ExpandDims_10:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Tile/multiples", "op": "Pack", "input": ["__inference_while_body_4688_4988_frozen/ExpandDims_10/dim:output:0", "strided_slice:output:0"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "Tile", "op": "Tile", "input": ["ExpandDims:output:0", "Tile/multiples:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "Cumsum", "op": "Cumsum", "input": ["Tile:output:0", "__inference_while_body_4688_4988_frozen/ExpandDims_10/dim:output:0"], "attr": {"reverse": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "exclusive": {"b": true}}}, {"name": "Exp", "op": "Exp", "input": ["Cumsum:out:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_4", "op": "ExpandDims", "input": ["Exp:y:0", "__inference_while_body_4688_4988_frozen/ExpandDims_4/dim:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "mul_1", "op": "Mul", "input": ["ExpandDims_3:output:0", "ExpandDims_4:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sum", "op": "Sum", "input": ["mul_1:z:0", "__inference_while_body_4688_4988_frozen/Sum/reduction_indices:output:0"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "div_no_nan", "op": "DivNoNan", "input": ["div_no_nan_truediv_0", "Sum:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_5", "op": "ExpandDims", "input": ["div_no_nan:z:0", "__inference_while_body_4688_4988_frozen/Sum/reduction_indices:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "mul_2", "op": "Mul", "input": ["ExpandDims_5:output:0", "mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_6", "op": "Mul", "input": ["ExpandDims_10:output:0", "mul_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_5", "op": "Mul", "input": ["mul_2:z:0", "pow:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sum_4", "op": "Sum", "input": ["mul_6:z:0", "__inference_while_body_4688_4988_frozen/Sum_4/reduction_indices:output:0"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "Sum_2", "op": "Sum", "input": ["mul_5:z:0", "__inference_while_body_4688_4988_frozen/Sum/reduction_indices:output:0"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "add", "op": "AddV2", "input": ["Sum_4:output:0", "placeholder_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sum_3", "op": "Sum", "input": ["Sum_2:output:0", "__inference_while_body_4688_4988_frozen/ExpandDims_4/dim:output:0"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "sub", "op": "Sub", "input": ["add:z:0", "truediv:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_1", "op": "RealDiv", "input": ["Sum_3:output:0", "placeholder_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "AddV2", "input": ["__inference_while_body_4688_4988_frozen/add_1/y:output:0", "truediv_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_2", "op": "AddV2", "input": ["add_1:z:0", "truediv_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_3", "op": "RealDiv", "input": ["sub:z:0", "add_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_1", "op": "Sub", "input": ["placeholder_1", "truediv_3:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}], "ret": {"identity": "add_3:z:0", "identity_2": "truediv_3:z:0", "expanddims_6_val_mat_sd": "expanddims_6_val_mat_sd_0", "shape_l_mat_sd": "shape_l_mat_sd_0", "div_no_nan_truediv": "div_no_nan_truediv_0", "identity_1": "while_maximum_iterations", "identity_3": "sub_1:z:0"}}, {"signature": {"name": "__inference_while_cond_4687_4880_frozen", "inputArg": [{"name": "while_loop_counter", "type": "DT_INT32"}, {"name": "while_maximum_iterations", "type": "DT_INT32"}, {"name": "placeholder", "type": "DT_FLOAT"}, {"name": "placeholder_1", "type": "DT_FLOAT"}, {"name": "while_cond_4687___redundant_placeholder0", "type": "DT_FLOAT"}, {"name": "while_cond_4687___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "while_cond_4687___redundant_placeholder2", "type": "DT_FLOAT"}], "outputArg": [{"name": "identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "__inference_while_cond_4687_4880_frozen/norm/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_cond_4687_4880_frozen/Greater/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "op": "Square", "input": ["placeholder"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Max", "op": "Max", "input": ["placeholder_1", "__inference_while_cond_4687_4880_frozen/norm/Const:output:0"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "norm/Sum", "op": "Sum", "input": ["norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul:y:0", "__inference_while_cond_4687_4880_frozen/norm/Const:output:0"], "attr": {"keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "norm/Sqrt", "op": "Sqrt", "input": ["norm/Sum:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "norm/Squeeze", "op": "Squeeze", "input": ["norm/Sqrt:y:0"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {}}}}, {"name": "truediv", "op": "RealDiv", "input": ["norm/Squeeze:output:0", "Max:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Greater", "op": "Greater", "input": ["truediv:z:0", "__inference_while_cond_4687_4880_frozen/Greater/y:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}], "ret": {"identity": "Greater:z:0"}}]}, "versions": {"producer": 175, "minConsumer": 12}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/while/maximum_iterations", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/mul/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/ones/Reshape/shape", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/ones_like/Const", "shape": [], "dtype": "float32"}, {"name": "ConstantFolding/PartitionedCall/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "__inference_while_body_4688_4988_frozen/Sum_4/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "__inference_while_body_4688_4988_frozen/add_1/y", "shape": [], "dtype": "float32"}, {"name": "__inference_while_body_4688_4988_frozen/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "__inference_while_body_4688_4988_frozen/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "__inference_while_body_4688_4988_frozen/Sum/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "__inference_while_body_4688_4988_frozen/ExpandDims_4/dim", "shape": [], "dtype": "int32"}, {"name": "__inference_while_body_4688_4988_frozen/truediv/x", "shape": [], "dtype": "float32"}, {"name": "__inference_while_body_4688_4988_frozen/ExpandDims_10/dim", "shape": [], "dtype": "int32"}, {"name": "__inference_while_cond_4687_4880_frozen/norm/Const", "shape": [1], "dtype": "int32"}, {"name": "__inference_while_cond_4687_4880_frozen/Greater/y", "shape": [], "dtype": "float32"}]}]}