{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"l_mat_sd:0": {"name": "l_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dx:0": {"name": "dx:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "current:0": {"name": "current:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "val_mat_sd:0": {"name": "val_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "d_mat_sd:0": {"name": "d_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "tolerance:0": {"name": "tolerance:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "u_mat_sd:0": {"name": "u_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "ch_n:0": {"name": "ch_n:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "c_mat_sn:0": {"name": "c_mat_sn:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dt:0": {"name": "dt:0", "dtype": "DT_FLOAT", "tensorShape": {}}}, "outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/Sum_4/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/mul_14/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_22/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_18/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/truediv_7/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/while_1/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/add_6/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_2/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/truediv_4/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_19/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice_19/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Tile/multiples/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice_18/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/strided_slice_18/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice_22/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/strided_slice_22/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/while_1/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "c_mat_sn", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "ch_n", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "current", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "d_mat_sd", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "dt", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "dx", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "l_mat_sd", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "tolerance", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "u_mat_sd", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "val_mat_sd", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "PartitionedCall/pow_1", "op": "Square", "input": ["ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_2", "op": "RealDiv", "input": ["PartitionedCall/truediv_4/x", "ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Log", "op": "Log", "input": ["ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_21", "op": "StridedSlice", "input": ["d_mat_sd", "PartitionedCall/strided_slice_22/stack", "PartitionedCall/strided_slice_22/stack", "PartitionedCall/strided_slice_22/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "new_axis_mask": {"i": "2"}, "end_mask": {"i": "5"}}}, {"name": "PartitionedCall/Shape_2", "op": "Shape", "input": ["l_mat_sd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice_17", "op": "StridedSlice", "input": ["l_mat_sd", "PartitionedCall/strided_slice_22/stack", "PartitionedCall/strided_slice_22/stack", "PartitionedCall/strided_slice_22/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "new_axis_mask": {"i": "2"}, "end_mask": {"i": "5"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_6", "op": "AddV2", "input": ["PartitionedCall/add_6/y", "tolerance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_20", "op": "StridedSlice", "input": ["u_mat_sd", "PartitionedCall/strided_slice_22/stack", "PartitionedCall/strided_slice_22/stack", "PartitionedCall/strided_slice_22/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "new_axis_mask": {"i": "2"}, "end_mask": {"i": "5"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/strided_slice_22", "op": "StridedSlice", "input": ["val_mat_sd", "PartitionedCall/strided_slice_22/stack", "PartitionedCall/strided_slice_22/stack", "PartitionedCall/strided_slice_22/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "2"}, "end_mask": {"i": "5"}}}, {"name": "PartitionedCall/truediv_4", "op": "RealDiv", "input": ["PartitionedCall/truediv_4/x", "PartitionedCall/pow_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_3", "op": "StridedSlice", "input": ["PartitionedCall/Log", "PartitionedCall/strided_slice_19/stack", "PartitionedCall/strided_slice_19/stack", "PartitionedCall/strided_slice_19/stack_2"], "attr": {"end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "2"}}}, {"name": "PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Shape_2", "PartitionedCall/strided_slice_18/stack_2", "PartitionedCall/strided_slice_2/stack_1", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/pow", "op": "Square", "input": ["PartitionedCall/strided_slice_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/strided_slice_17", "PartitionedCall/strided_slice_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Tile/multiples/0", "PartitionedCall/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/Tile", "op": "Tile", "input": ["PartitionedCall/strided_slice_3", "PartitionedCall/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cumsum", "op": "Cumsum", "input": ["PartitionedCall/Tile", "PartitionedCall/while_1/maximum_iterations"], "attr": {"reverse": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "exclusive": {"b": true}}}, {"name": "PartitionedCall/Exp", "op": "Exp", "input": ["PartitionedCall/Cumsum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_11", "op": "StridedSlice", "input": ["PartitionedCall/Exp", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/strided_slice_11", "PartitionedCall/strided_slice_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_4", "op": "Mul", "input": ["PartitionedCall/mul_3", "PartitionedCall/strided_slice_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum", "op": "Sum", "input": ["PartitionedCall/mul_1", "PartitionedCall/while_1/maximum_iterations"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/Sum_1", "op": "Sum", "input": ["PartitionedCall/mul_4", "PartitionedCall/while_1/maximum_iterations"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/strided_slice_15", "op": "StridedSlice", "input": ["PartitionedCall/Sum", "PartitionedCall/strided_slice_19/stack", "PartitionedCall/strided_slice_19/stack", "PartitionedCall/strided_slice_19/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "1"}, "new_axis_mask": {"i": "2"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/truediv", "op": "RealDiv", "input": ["c_mat_sn", "PartitionedCall/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_14", "op": "StridedSlice", "input": ["PartitionedCall/Sum_1", "PartitionedCall/strided_slice_19/stack", "PartitionedCall/strided_slice_19/stack", "PartitionedCall/strided_slice_19/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "2"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_8", "op": "StridedSlice", "input": ["PartitionedCall/truediv", "PartitionedCall/strided_slice_19/stack", "PartitionedCall/strided_slice_19/stack", "PartitionedCall/strided_slice_19/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "2"}, "end_mask": {"i": "0"}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/mul_1", "PartitionedCall/strided_slice_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_6", "op": "Mul", "input": ["PartitionedCall/add_6/y", "PartitionedCall/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_5", "op": "Mul", "input": ["PartitionedCall/mul_2", "PartitionedCall/pow"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_9", "op": "Mul", "input": ["PartitionedCall/mul_2", "PartitionedCall/strided_slice_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_7", "op": "Mul", "input": ["PartitionedCall/mul_6", "PartitionedCall/strided_slice_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_3", "op": "Sum", "input": ["PartitionedCall/mul_9", "PartitionedCall/Sum_2/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_8", "op": "Mul", "input": ["PartitionedCall/mul_7", "PartitionedCall/strided_slice_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/Sum_3", "ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_1", "op": "RealDiv", "input": ["PartitionedCall/mul_8", "PartitionedCall/strided_slice_15"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_1", "op": "Sub", "input": ["PartitionedCall/add", "PartitionedCall/truediv_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul_5", "PartitionedCall/truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_2", "op": "Sum", "input": ["PartitionedCall/sub", "PartitionedCall/Sum_2/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/truediv_3", "op": "RealDiv", "input": ["PartitionedCall/Sum_2", "ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_1", "op": "AddV2", "input": ["PartitionedCall/add_6/y", "PartitionedCall/truediv_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_2", "op": "AddV2", "input": ["PartitionedCall/add_1", "PartitionedCall/truediv_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_5", "op": "RealDiv", "input": ["PartitionedCall/sub_1", "PartitionedCall/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/while", "op": "StatelessWhile", "input": ["PartitionedCall/while_1/loop_counter", "PartitionedCall/while_1/maximum_iterations", "ch_n", "PartitionedCall/truediv_5", "PartitionedCall/Exp", "PartitionedCall/sub_1", "PartitionedCall/Sum", "c_mat_sn", "l_mat_sd", "val_mat_sd"], "attr": {"_num_original_outputs": {"i": "10"}, "body": {"func": {"name": "__inference_while_body_181_1726_frozen"}}, "output_shapes": {"list": {"shape": [{}, {}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}]}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "_lower_using_switch_merge": {"b": false}, "_read_only_resource_inputs": {"list": {}}, "parallel_iterations": {"i": "10"}, "cond": {"func": {"name": "__inference_while_cond_180_1991_frozen"}}}}, {"name": "PartitionedCall/Min", "op": "Min", "input": ["PartitionedCall/while:2", "PartitionedCall/strided_slice_18/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/Less", "op": "Less", "input": ["PartitionedCall/Min", "PartitionedCall/Less/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/cond", "op": "StatelessIf", "input": ["PartitionedCall/Less", "c_mat_sn", "l_mat_sd", "ch_n", "val_mat_sd", "PartitionedCall/while:4", "PartitionedCall/while:2", "PartitionedCall/while:6"], "attr": {"Tin": {"list": {"type": ["DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "else_branch": {"func": {"name": "__inference_cond_false_399_1746_frozen"}}, "output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}]}}, "_read_only_resource_inputs": {"list": {}}, "_lower_using_switch_merge": {"b": false}, "Tout": {"list": {"type": ["DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "Tcond": {"type": "DT_BOOL"}, "then_branch": {"func": {"name": "__inference_cond_true_398_1949_frozen"}}}}, {"name": "PartitionedCall/strided_slice_18", "op": "StridedSlice", "input": ["PartitionedCall/cond", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "1"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/cond:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_18", "op": "Mul", "input": ["PartitionedCall/cond:1", "PartitionedCall/mul_18/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_7", "op": "RealDiv", "input": ["PartitionedCall/truediv_7/x", "PartitionedCall/cond:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_19", "op": "StridedSlice", "input": ["PartitionedCall/cond:2", "PartitionedCall/strided_slice_19/stack", "PartitionedCall/strided_slice_19/stack", "PartitionedCall/strided_slice_19/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "1"}, "new_axis_mask": {"i": "2"}, "end_mask": {"i": "0"}}}, {"name": "PartitionedCall/mul_10", "op": "Mul", "input": ["PartitionedCall/strided_slice_17", "PartitionedCall/strided_slice_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_3", "op": "AddV2", "input": ["PartitionedCall/mul_18", "PartitionedCall/truediv_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_2", "op": "Sub", "input": ["PartitionedCall/mul_18", "PartitionedCall/truediv_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_6", "op": "RealDiv", "input": ["PartitionedCall/mul_10", "PartitionedCall/strided_slice_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_19", "op": "Mul", "input": ["PartitionedCall/add_3", "PartitionedCall/mul_14/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_22", "op": "Mul", "input": ["PartitionedCall/mul_22/x", "PartitionedCall/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_11", "op": "Mul", "input": ["PartitionedCall/strided_slice_20", "PartitionedCall/truediv_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_12", "op": "Mul", "input": ["PartitionedCall/strided_slice_21", "PartitionedCall/truediv_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_4", "op": "Sum", "input": ["PartitionedCall/mul_11", "PartitionedCall/Sum_4/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/mul_13", "op": "Mul", "input": ["PartitionedCall/mul_11", "PartitionedCall/strided_slice_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_5", "op": "Sum", "input": ["PartitionedCall/mul_12", "PartitionedCall/Sum_4/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_15", "op": "Mul", "input": ["PartitionedCall/mul_12", "PartitionedCall/strided_slice_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_6", "op": "Sum", "input": ["PartitionedCall/mul_13", "PartitionedCall/Sum_4/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/Sum_7", "op": "Sum", "input": ["PartitionedCall/mul_15", "PartitionedCall/Sum_4/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_14", "op": "Mul", "input": ["PartitionedCall/Sum_6", "PartitionedCall/mul_14/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_16", "op": "Mul", "input": ["PartitionedCall/Sum_7", "PartitionedCall/mul_14/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_17", "op": "Mul", "input": ["PartitionedCall/mul_14", "c_mat_sn"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_20", "op": "Mul", "input": ["PartitionedCall/mul_16", "c_mat_sn"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_8", "op": "Sum", "input": ["PartitionedCall/mul_17", "PartitionedCall/while_1/loop_counter"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_9", "op": "Sum", "input": ["PartitionedCall/mul_20", "PartitionedCall/while_1/loop_counter"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_4", "op": "AddV2", "input": ["PartitionedCall/Sum_8", "PartitionedCall/mul_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_5", "op": "AddV2", "input": ["PartitionedCall/Sum_9", "PartitionedCall/mul_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/while_1", "op": "StatelessWhile", "input": ["PartitionedCall/while_1/loop_counter", "PartitionedCall/while_1/maximum_iterations", "dt", "PartitionedCall/add_6", "c_mat_sn", "tolerance", "c_mat_sn", "PartitionedCall/Sum_4", "PartitionedCall/add_4", "current", "PartitionedCall/Sum_5", "dx", "PartitionedCall/add_5"], "attr": {"parallel_iterations": {"i": "10"}, "cond": {"func": {"name": "__inference_while_1_cond_848_1775_frozen"}}, "_num_original_outputs": {"i": "13"}, "body": {"func": {"name": "__inference_while_1_body_849_1581_frozen"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}]}, {}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {}, {"dim": [{"size": "-1"}]}]}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "_lower_using_switch_merge": {"b": false}, "_read_only_resource_inputs": {"list": {}}}}, {"name": "Identity_2", "op": "Identity", "input": ["PartitionedCall/while_1:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["PartitionedCall/while_1:4"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_while_1_body_849_1581_frozen", "inputArg": [{"name": "while_1_loop_counter", "type": "DT_INT32"}, {"name": "while_1_maximum_iterations", "type": "DT_INT32"}, {"name": "placeholder", "type": "DT_FLOAT"}, {"name": "placeholder_1", "type": "DT_FLOAT"}, {"name": "placeholder_2", "type": "DT_FLOAT"}, {"name": "tolerance_0", "type": "DT_FLOAT"}, {"name": "shape_c_mat_sn_0", "type": "DT_FLOAT"}, {"name": "mul_sum_4_0", "type": "DT_FLOAT"}, {"name": "strided_slice_1_add_4_0", "type": "DT_FLOAT"}, {"name": "mul_1_current_0", "type": "DT_FLOAT"}, {"name": "strided_slice_11_sum_5_0", "type": "DT_FLOAT"}, {"name": "truediv_4_dx_0", "type": "DT_FLOAT"}, {"name": "strided_slice_17_add_5_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "identity", "type": "DT_INT32"}, {"name": "identity_1", "type": "DT_INT32"}, {"name": "identity_2", "type": "DT_FLOAT"}, {"name": "identity_3", "type": "DT_FLOAT"}, {"name": "identity_4", "type": "DT_FLOAT"}, {"name": "tolerance", "type": "DT_FLOAT"}, {"name": "shape_c_mat_sn", "type": "DT_FLOAT"}, {"name": "mul_sum_4", "type": "DT_FLOAT"}, {"name": "strided_slice_1_add_4", "type": "DT_FLOAT"}, {"name": "mul_1_current", "type": "DT_FLOAT"}, {"name": "strided_slice_11_sum_5", "type": "DT_FLOAT"}, {"name": "truediv_4_dx", "type": "DT_FLOAT"}, {"name": "strided_slice_17_add_5", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_while_1_body_849_1581_frozen/mul_133/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/pow_7/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/clip_by_value/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/clip_by_value/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_126/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_128/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_129/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_130/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_131/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_132/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_105/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_127/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_107/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_108/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_109/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_85/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_86/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_87/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_88/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_66/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_67/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_68/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_48/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_49/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_31/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/Max_6/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_114/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/sub_76/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/strided_slice_195/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_1_body_849_1581_frozen/Pad_6/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_1_body_849_1581_frozen/strided_slice_196/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_15/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_32/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_50/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_69/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_89/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_1_body_849_1581_frozen/strided_slice_175/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_1_body_849_1581_frozen/strided_slice_175/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_1_body_849_1581_frozen/strided_slice_200/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_1_body_849_1581_frozen/concat_6/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_while_1_body_849_1581_frozen/mul_110/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_1_body_849_1581_frozen/ExpandDims_12/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "mul", "op": "Mul", "input": ["mul_sum_4_0", "shape_c_mat_sn_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_112", "op": "Mul", "input": ["mul_1_current_0", "mul_sum_4_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_115", "op": "Mul", "input": ["__inference_while_1_body_849_1581_frozen/mul_114/x:output:0", "mul_1_current_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_175", "op": "StridedSlice", "input": ["strided_slice_1_add_4_0", "__inference_while_1_body_849_1581_frozen/strided_slice_175/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_175/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_175/stack_2:output:0"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}}}, {"name": "strided_slice_181", "op": "StridedSlice", "input": ["mul_sum_4_0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "3"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_183", "op": "StridedSlice", "input": ["mul_sum_4_0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_200/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "strided_slice_12", "op": "StridedSlice", "input": ["shape_c_mat_sn_0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"end_mask": {"i": "3"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "strided_slice_14", "op": "StridedSlice", "input": ["shape_c_mat_sn_0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_200/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "strided_slice_185", "op": "StridedSlice", "input": ["strided_slice_11_sum_5_0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "3"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_187", "op": "StridedSlice", "input": ["strided_slice_11_sum_5_0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_200/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "strided_slice_191", "op": "StridedSlice", "input": ["strided_slice_17_add_5_0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "1"}, "end_mask": {"i": "2"}}}, {"name": "strided_slice_192", "op": "StridedSlice", "input": ["strided_slice_17_add_5_0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_200/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "2"}, "new_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}}}, {"name": "strided_slice_182", "op": "StridedSlice", "input": ["strided_slice_1_add_4_0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "1"}, "end_mask": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "strided_slice_184", "op": "StridedSlice", "input": ["strided_slice_1_add_4_0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_200/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"begin_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "add_70", "op": "AddV2", "input": ["__inference_while_1_body_849_1581_frozen/ExpandDims_12/dim:output:0", "while_1_loop_counter"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "truediv", "op": "RealDiv", "input": ["mul:z:0", "strided_slice_175:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_55", "op": "RealDiv", "input": ["mul_112:z:0", "strided_slice_175:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_5", "op": "Sub", "input": ["strided_slice_12:output:0", "strided_slice_14:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_6", "op": "Mul", "input": ["strided_slice_12:output:0", "strided_slice_185:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_7", "op": "Mul", "input": ["strided_slice_14:output:0", "strided_slice_187:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_73", "op": "Sub", "input": ["strided_slice_191:output:0", "strided_slice_192:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_56", "op": "RealDiv", "input": ["strided_slice_181:output:0", "strided_slice_182:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_57", "op": "RealDiv", "input": ["strided_slice_183:output:0", "strided_slice_184:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_15", "op": "StridedSlice", "input": ["truediv:z:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "3"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_16", "op": "StridedSlice", "input": ["truediv:z:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_200/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_2", "op": "Mul", "input": ["shape_c_mat_sn_0", "truediv_55:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Pad", "op": "Pad", "input": ["sub_5:z:0", "__inference_while_1_body_849_1581_frozen/Pad_6/paddings:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "sub", "op": "Sub", "input": ["mul_6:z:0", "mul_7:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_58", "op": "AddV2", "input": ["truediv_56:z:0", "truediv_57:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_2", "op": "AddV2", "input": ["strided_slice_15:output:0", "strided_slice_16:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_5", "op": "StridedSlice", "input": ["mul_2:z:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_3", "op": "StridedSlice", "input": ["mul_2:z:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "3"}}}, {"name": "strided_slice_4", "op": "StridedSlice", "input": ["mul_2:z:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_200/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_6", "op": "StridedSlice", "input": ["mul_2:z:0", "__inference_while_1_body_849_1581_frozen/strided_slice_200/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "strided_slice_21", "op": "StridedSlice", "input": ["Pad:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_195/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "3"}}}, {"name": "strided_slice_22", "op": "StridedSlice", "input": ["Pad:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_196/stack_1:output:0", "__inference_while_1_body_849_1581_frozen/strided_slice_179/stack_2:output:0"], "attr": {"end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "new_axis_mask": {"i": "0"}}}, {"name": "truediv_4", "op": "RealDiv", "input": ["sub:z:0", "truediv_4_dx_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_116", "op": "Mul", "input": ["add_58:z:0", "mul_115:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_8", "op": "Mul", "input": ["add_2:z:0", "__inference_while_1_body_849_1581_frozen/mul_114/x:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "AddV2", "input": ["strided_slice_3:output:0", "strided_slice_4:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Abs_1", "op": "Abs", "input": ["strided_slice_21:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_4", "op": "AddV2", "input": ["strided_slice_21:output:0", "strided_slice_22:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_3", "op": "Sub", "input": ["strided_slice_21:output:0", "strided_slice_22:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Abs_2", "op": "Abs", "input": ["strided_slice_22:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Abs_24", "op": "Abs", "input": ["mul_116:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_9", "op": "Mul", "input": ["mul_8:z:0", "sub_73:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_3", "op": "Mul", "input": ["add:z:0", "__inference_while_1_body_849_1581_frozen/mul_114/x:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_3", "op": "AddV2", "input": ["Abs_1:y:0", "Abs_2:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Max_6", "op": "Max", "input": ["Abs_24:y:0", "__inference_while_1_body_849_1581_frozen/Max_6/reduction_indices:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "truediv_5", "op": "RealDiv", "input": ["mul_9:z:0", "truediv_4_dx_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "div_no_nan", "op": "DivNoNan", "input": ["sub_3:z:0", "add_3:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_123", "op": "Mul", "input": ["Max_6:output:0", "__inference_while_1_body_849_1581_frozen/mul_114/x:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_7", "op": "Sub", "input": ["truediv_5:z:0", "truediv_4:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Abs_3", "op": "Abs", "input": ["div_no_nan:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_5", "op": "AddV2", "input": ["mul_3:z:0", "sub_7:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow", "op": "Square", "input": ["Abs_3:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_4", "op": "Sub", "input": ["__inference_while_1_body_849_1581_frozen/sub_76/x:output:0", "pow:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_10", "op": "Mul", "input": ["__inference_while_1_body_849_1581_frozen/mul_114/x:output:0", "sub_4:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_11", "op": "Mul", "input": ["add_4:z:0", "mul_10:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_6", "op": "Sub", "input": ["sub_5:z:0", "mul_11:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_13", "op": "Mul", "input": ["mul_123:z:0", 