{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"val_mat_sd:0": {"name": "val_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "d_mat_sd:0": {"name": "d_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "tolerance:0": {"name": "tolerance:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "u_mat_sd:0": {"name": "u_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "ch_n:0": {"name": "ch_n:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "c_mat_sn:0": {"name": "c_mat_sn:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dt:0": {"name": "dt:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "l_mat_sd:0": {"name": "l_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dx:0": {"name": "dx:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "current:0": {"name": "current:0", "dtype": "DT_FLOAT", "tensorShape": {}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "Identity_3:0": {"name": "Identity_3:0", "dtype": "DT_FLOAT", "tensorShape": {}}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Sum_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/ExpandDims_9/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Sum_4/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/truediv_4/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/mul_6/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "c_mat_sn", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "ch_n", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "current", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "d_mat_sd", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "dt", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "dx", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "l_mat_sd", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "tolerance", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "u_mat_sd", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "val_mat_sd", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["c_mat_sn"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/pow_1", "op": "Square", "input": ["ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Log", "op": "Log", "input": ["ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_2", "op": "RealDiv", "input": ["PartitionedCall/truediv_4/x", "ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["dt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_23", "op": "Mul", "input": ["PartitionedCall/mul_6/x", "dt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_7", "op": "ExpandDims", "input": ["l_mat_sd", "PartitionedCall/ExpandDims_9/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Shape_2", "op": "Shape", "input": ["l_mat_sd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/ExpandDims_9", "op": "ExpandDims", "input": ["val_mat_sd", "PartitionedCall/ExpandDims_9/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_4", "op": "RealDiv", "input": ["PartitionedCall/truediv_4/x", "PartitionedCall/pow_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/Log", "PartitionedCall/ExpandDims_9/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "Identity_3", "op": "Identity", "input": ["PartitionedCall/mul_23"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Shape_2", "PartitionedCall/strided_slice_2/stack", "PartitionedCall/strided_slice_2/stack_1", "PartitionedCall/strided_slice_2/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/pow", "op": "Square", "input": ["PartitionedCall/ExpandDims_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/ExpandDims_7", "PartitionedCall/ExpandDims_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/ExpandDims_9/dim", "PartitionedCall/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/Tile", "op": "Tile", "input": ["PartitionedCall/ExpandDims", "PartitionedCall/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cumsum", "op": "Cumsum", "input": ["PartitionedCall/Tile", "PartitionedCall/ExpandDims_9/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "exclusive": {"b": true}, "reverse": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Exp", "op": "Exp", "input": ["PartitionedCall/Cumsum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_8", "op": "ExpandDims", "input": ["PartitionedCall/Exp", "PartitionedCall/while/loop_counter"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/ExpandDims_7", "PartitionedCall/ExpandDims_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_4", "op": "Mul", "input": ["PartitionedCall/ExpandDims_8", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum", "op": "Sum", "input": ["PartitionedCall/mul_1", "PartitionedCall/Sum_1/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/Sum_1", "op": "Sum", "input": ["PartitionedCall/mul_4", "PartitionedCall/Sum_1/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_12", "op": "ExpandDims", "input": ["PartitionedCall/Sum", "PartitionedCall/Sum_1/reduction_indices"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv", "op": "RealDiv", "input": ["c_mat_sn", "PartitionedCall/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_11", "op": "ExpandDims", "input": ["PartitionedCall/Sum_1", "PartitionedCall/Sum_1/reduction_indices"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_5", "op": "ExpandDims", "input": ["PartitionedCall/truediv", "PartitionedCall/Sum_1/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/ExpandDims_5", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_6", "op": "Mul", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_6/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_5", "op": "Mul", "input": ["PartitionedCall/mul_2", "PartitionedCall/pow"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_9", "op": "Mul", "input": ["PartitionedCall/ExpandDims_9", "PartitionedCall/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_7", "op": "Mul", "input": ["PartitionedCall/ExpandDims_9", "PartitionedCall/mul_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_4", "op": "Sum", "input": ["PartitionedCall/mul_9", "PartitionedCall/Sum_4/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_8", "op": "Mul", "input": ["PartitionedCall/ExpandDims_11", "PartitionedCall/mul_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/Sum_4", "ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_1", "op": "RealDiv", "input": ["PartitionedCall/mul_8", "PartitionedCall/ExpandDims_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_1", "op": "Sub", "input": ["PartitionedCall/add", "PartitionedCall/truediv_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul_5", "PartitionedCall/truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_2", "op": "Sum", "input": ["PartitionedCall/sub", "PartitionedCall/Sum_1/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_3", "op": "Sum", "input": ["PartitionedCall/Sum_2", "PartitionedCall/while/loop_counter"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_3", "op": "RealDiv", "input": ["PartitionedCall/Sum_3", "ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_1", "op": "AddV2", "input": ["PartitionedCall/mul_6/x", "PartitionedCall/truediv_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_2", "op": "AddV2", "input": ["PartitionedCall/add_1", "PartitionedCall/truediv_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_5", "op": "RealDiv", "input": ["PartitionedCall/sub_1", "PartitionedCall/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/while", "op": "StatelessWhile", "input": ["PartitionedCall/while/loop_counter", "PartitionedCall/while/maximum_iterations", "PartitionedCall/truediv_5", "PartitionedCall/Sum", "PartitionedCall/Exp", "PartitionedCall/sub_1", "ch_n", "c_mat_sn", "l_mat_sd", "val_mat_sd"], "attr": {"output_shapes": {"list": {"shape": [{}, {}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}]}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "_read_only_resource_inputs": {"list": {}}, "_lower_using_switch_merge": {"b": false}, "parallel_iterations": {"i": "10"}, "cond": {"func": {"name": "__inference_while_cond_154_493_frozen"}}, "_num_original_outputs": {"i": "10"}, "body": {"func": {"name": "__inference_while_body_155_245_frozen"}}}}, {"name": "PartitionedCall/Min", "op": "Min", "input": ["PartitionedCall/while:6", "PartitionedCall/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/Less", "op": "Less", "input": ["PartitionedCall/Min", "PartitionedCall/Less/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/cond", "op": "StatelessIf", "input": ["PartitionedCall/Less", "c_mat_sn", "l_mat_sd", "ch_n", "val_mat_sd", "PartitionedCall/while:6", "PartitionedCall/while:3", "PartitionedCall/while:4"], "attr": {"Tout": {"list": {"type": ["DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "then_branch": {"func": {"name": "__inference_cond_true_346_422_frozen"}}, "Tcond": {"type": "DT_BOOL"}, "Tin": {"list": {"type": ["DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "else_branch": {"func": {"name": "__inference_cond_false_347_451_frozen"}}, "output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}]}}, "_read_only_resource_inputs": {"list": {}}, "_lower_using_switch_merge": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/cond"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_cond_false_497_279_frozen", "inputArg": [{"name": "placeholder", "type": "DT_FLOAT"}, {"name": "identity_greater", "type": "DT_BOOL"}], "outputArg": [{"name": "identity", "type": "DT_BOOL"}]}, "ret": {"identity": "identity_greater"}}, {"signature": {"name": "__inference_cond_true_346_422_frozen", "inputArg": [{"name": "shape_c_mat_sn", "type": "DT_FLOAT"}, {"name": "shape_2_l_mat_sd", "type": "DT_FLOAT"}, {"name": "log_ch_n", "type": "DT_FLOAT"}, {"name": "expanddims_6_val_mat_sd", "type": "DT_FLOAT"}, {"name": "placeholder", "type": "DT_FLOAT"}, {"name": "placeholder_1", "type": "DT_FLOAT"}, {"name": "placeholder_2", "type": "DT_FLOAT"}], "outputArg": [{"name": "identity", "type": "DT_FLOAT"}, {"name": "identity_1", "type": "DT_FLOAT"}, {"name": "identity_2", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_cond_true_346_422_frozen/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_cond_true_346_422_frozen/add_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_cond_true_346_422_frozen/mul_6/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_cond_true_346_422_frozen/Sum_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_cond_true_346_422_frozen/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_cond_true_346_422_frozen/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "__inference_cond_true_346_422_frozen/ExpandDims_9/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_cond_true_346_422_frozen/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_cond_true_346_422_frozen/Sum_4/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_cond_true_346_422_frozen/truediv_4/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Shape_2", "op": "Shape", "input": ["shape_2_l_mat_sd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "pow_1", "op": "Square", "input": ["log_ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Log", "op": "Log", "input": ["log_ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_9", "op": "ExpandDims", "input": ["expanddims_6_val_mat_sd", "__inference_cond_true_346_422_frozen/ExpandDims_9/dim:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_7", "op": "ExpandDims", "input": ["shape_2_l_mat_sd", "__inference_cond_true_346_422_frozen/ExpandDims_9/dim:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "truediv_2", "op": "RealDiv", "input": ["__inference_cond_true_346_422_frozen/truediv_4/x:output:0", "log_ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_2", "op": "StridedSlice", "input": ["Shape_2:output:0", "__inference_cond_true_346_422_frozen/strided_slice_2/stack:output:0", "__inference_cond_true_346_422_frozen/strided_slice_2/stack_1:output:0", "__inference_cond_true_346_422_frozen/strided_slice_2/stack:output:0"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "truediv_4", "op": "RealDiv", "input": ["__inference_cond_true_346_422_frozen/truediv_4/x:output:0", "pow_1:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims", "op": "ExpandDims", "input": ["Log:y:0", "__inference_cond_true_346_422_frozen/ExpandDims_9/dim:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "pow", "op": "Square", "input": ["ExpandDims_9:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_3", "op": "Mul", "input": ["ExpandDims_7:output:0", "ExpandDims_9:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Tile/multiples", "op": "Pack", "input": ["__inference_cond_true_346_422_frozen/ExpandDims_9/dim:output:0", "strided_slice_2:output:0"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "Tile", "op": "Tile", "input": ["ExpandDims:output:0", "Tile/multiples:output:0"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Cumsum", "op": "Cumsum", "input": ["Tile:output:0", "__inference_cond_true_346_422_frozen/ExpandDims_9/dim:output:0"], "attr": {"reverse": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "exclusive": {"b": true}}}, {"name": "Exp", "op": "Exp", "input": ["Cumsum:out:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_8", "op": "ExpandDims", "input": ["Exp:y:0", "__inference_cond_true_346_422_frozen/while/loop_counter:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "mul_4", "op": "Mul", "input": ["ExpandDims_8:output:0", "mul_3:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_1", "op": "Mul", "input": ["ExpandDims_7:output:0", "ExpandDims_8:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sum_1", "op": "Sum", "input": ["mul_4:z:0", "__inference_cond_true_346_422_frozen/Sum_1/reduction_indices:output:0"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Sum", "op": "Sum", "input": ["mul_1:z:0", "__inference_cond_true_346_422_frozen/Sum_1/reduction_indices:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "ExpandDims_11", "op": "ExpandDims", "input": ["Sum_1:output:0", "__inference_cond_true_346_422_frozen/Sum_1/reduction_indices:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_12", "op": "ExpandDims", "input": ["Sum:output:0", "__inference_cond_true_346_422_frozen/Sum_1/reduction_indices:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "truediv", "op": "RealDiv", "input": ["shape_c_mat_sn", "Sum:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_5", "op": "ExpandDims", "input": ["truediv:z:0", "__inference_cond_true_346_422_frozen/Sum_1/reduction_indices:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "mul_2", "op": "Mul", "input": ["ExpandDims_5:output:0", "mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_5", "op": "Mul", "input": ["mul_2:z:0", "pow:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_6", "op": "Mul", "input": ["mul_2:z:0", "__inference_cond_true_346_422_frozen/mul_6/x:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_9", "op": "Mul", "input": ["ExpandDims_9:output:0", "mul_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_7", "op": "Mul", "input": ["ExpandDims_9:output:0", "mul_6:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sum_4", "op": "Sum", "input": ["mul_9:z:0", "__inference_cond_true_346_422_frozen/Sum_4/reduction_indices:output:0"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_8", "op": "Mul", "input": ["ExpandDims_11:output:0", "mul_7:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "AddV2", "input": ["Sum_4:output:0", "log_ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_1", "op": "RealDiv", "input": ["mul_8:z:0", "ExpandDims_12:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_1", "op": "Sub", "input": ["add:z:0", "truediv_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub", "op": "Sub", "input": ["mul_5:z:0", "truediv_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sum_2", "op": "Sum", "input": ["sub:z:0", "__inference_cond_true_346_422_frozen/Sum_1/reduction_indices:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Sum_3", "op": "Sum", "input": ["Sum_2:output:0", "__inference_cond_true_346_422_frozen/while/loop_counter:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "truediv_3", "op": "RealDiv", "input": ["Sum_3:output:0", "log_ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "AddV2", "input": ["__inference_cond_true_346_422_frozen/add_1/y:output:0", "truediv_3:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_2", "op": "AddV2", "input": ["add_1:z:0", "truediv_4:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_5", "op": "RealDiv", "input": ["sub_1:z:0", "add_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "while", "op": "StatelessWhile", "input": ["__inference_cond_true_346_422_frozen/while/loop_counter:output:0", "__inference_cond_true_346_422_frozen/while/maximum_iterations:output:0", "truediv_5:z:0", "Sum:output:0", "Exp:y:0", "sub_1:z:0", "log_ch_n", "shape_c_mat_sn", "shape_2_l_mat_sd", "expanddims_6_val_mat_sd"], "attr": {"cond": {"func": {"name": "__inference_while_cond_477_301_frozen"}}, "_num_original_outputs": {"i": "10"}, "body": {"func": {"name": "__inference_while_body_478_120_frozen"}}, "output_shapes": {"list": {"shape": [{}, {}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}]}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "_read_only_resource_inputs": {"list": {}}, "_lower_using_switch_merge": {"b": false}, "parallel_iterations": {"i": "10"}}}], "ret": {"identity": "while:output:6", "identity_1": "while:output:3", "identity_2": "while:output:4"}}, {"signature": {"name": "__inference_while_body_478_120_frozen", "inputArg": [{"name": "while_loop_counter", "type": "DT_INT32"}, {"name": "while_maximum_iterations", "type": "DT_INT32"}, {"name": "placeholder", "type": "DT_FLOAT"}, {"name": "placeholder_1", "type": "DT_FLOAT"}, {"name": "placeholder_2", "type": "DT_FLOAT"}, {"name": "placeholder_3", "type": "DT_FLOAT"}, {"name": "placeholder_4", "type": "DT_FLOAT"}, {"name": "shape_c_mat_sn_0", "type": "DT_FLOAT"}, {"name": "shape_2_l_mat_sd_0", "type": "DT_FLOAT"}, {"name": "expanddims_6_val_mat_sd_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "identity", "type": "DT_INT32"}, {"name": "identity_1", "type": "DT_INT32"}, {"name": "identity_2", "type": "DT_FLOAT"}, {"name": "identity_3", "type": "DT_FLOAT"}, {"name": "identity_4", "type": "DT_FLOAT"}, {"name": "identity_5", "type": "DT_FLOAT"}, {"name": "identity_6", "type": "DT_FLOAT"}, {"name": "shape_c_mat_sn", "type": "DT_FLOAT"}, {"name": "shape_2_l_mat_sd", "type": "DT_FLOAT"}, {"name": "expanddims_6_val_mat_sd", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_while_body_478_120_frozen/add_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_478_120_frozen/mul_6/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_478_120_frozen/Sum_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_478_120_frozen/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_478_120_frozen/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_478_120_frozen/ExpandDims_8/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_478_120_frozen/Sum_4/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_478_120_frozen/truediv_4/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_478_120_frozen/ExpandDims_9/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "sub", "op": "Sub", "input": ["placeholder_4", "placeholder"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Shape_2", "op": "Shape", "input": ["shape_2_l_mat_sd_0"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "ExpandDims_9", "op": "ExpandDims", "input": ["expanddims_6_val_mat_sd_0", "__inference_while_body_478_120_frozen/ExpandDims_9/dim:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_7", "op": "ExpandDims", "input": ["shape_2_l_mat_sd_0", "__inference_while_body_478_120_frozen/ExpandDims_9/dim:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "add_3", "op": "AddV2", "input": ["__inference_while_body_478_120_frozen/ExpandDims_9/dim:output:0", "while_loop_counter"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "pow_1", "op": "Square", "input": ["sub:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Log", "op": "Log", "input": ["sub:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_2", "op": "RealDiv", "input": ["__inference_while_body_478_120_frozen/truediv_4/x:output:0", "sub:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_2", "op": "StridedSlice", "input": ["Shape_2:output:0", "__inference_while_body_478_120_frozen/strided_slice_2/stack:output:0", "__inference_while_body_478_120_frozen/strided_slice_2/stack_1:output:0", "__inference_while_body_478_120_frozen/strided_slice_2/stack:output:0"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "pow", "op": "Square", "input": ["ExpandDims_9:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_3", "op": "Mul", "input": ["ExpandDims_7:output:0", "ExpandDims_9:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_4", "op": "RealDiv", "input": ["__inference_while_body_478_120_frozen/truediv_4/x:output:0", "pow_1:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims", "op": "ExpandDims", "input": ["Log:y:0", "__inference_while_body_478_120_frozen/ExpandDims_9/dim:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Tile/multiples", "op": "Pack", "input": ["__inference_while_body_478_120_frozen/ExpandDims_9/dim:output:0", "strided_slice_2:output:0"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "Tile", "op": "Tile", "input": ["ExpandDims:output:0", "Tile/multiples:output:0"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Cumsum", "op": "Cumsum", "input": ["Tile:output:0", "__inference_while_body_478_120_frozen/ExpandDims_9/dim:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "exclusive": {"b": true}, "reverse": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Exp", "op": "Exp", "input": ["Cumsum:out:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_8", "op": "ExpandDims", "input": ["Exp:y:0", "__inference_while_body_478_120_frozen/ExpandDims_8/dim:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_4", "op": "Mul", "input": ["ExpandDims_8:output:0", "mul_3:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_1", "op": "Mul", "input": ["ExpandDims_7:output:0", "ExpandDims_8:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sum_1", "op": "Sum", "input": ["mul_4:z:0", "__inference_while_body_478_120_frozen/Sum_1/reduction_indices:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Sum", "op": "Sum", "input": ["mul_1:z:0", "__inference_while_body_478_120_frozen/Sum_1/reduction_indices:output:0"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_11", "op": "ExpandDims", "input": ["Sum_1:output:0", "__inference_while_body_478_120_frozen/Sum_1/reduction_indices:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_12", "op": "ExpandDims", "input": ["Sum:output:0", "__inference_while_body_478_120_frozen/Sum_1/reduction_indices:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "truediv", "op": "RealDiv", "input": ["shape_c_mat_sn_0", "Sum:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_5", "op": "ExpandDims", "input": ["truediv:z:0", "__inference_while_body_478_120_frozen/Sum_1/reduction_indices:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_2", "op": "Mul", "input": ["ExpandDims_5:output:0", "mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_5", "op": "Mul", "input": ["mul_2:z:0", "pow:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_6", "op": "Mul", "input": ["mul_2:z:0", "__inference_while_body_478_120_frozen/mul_6/x:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_9", "op": "Mul", "input": ["ExpandDims_9:output:0", "mul_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_7", "op": "Mul", "input": ["ExpandDims_9:output:0", "mul_6:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sum_4", "op": "Sum", "input": ["mul_9:z:0", "__inference_while_body_478_120_frozen/Sum_4/reduction_indices:output:0"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_8", "op": "Mul", "input": ["ExpandDims_11:output:0", "mul_7:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "AddV2", "input": ["Sum_4:output:0", "sub:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_1", "op": "RealDiv", "input": ["mul_8:z:0", "ExpandDims_12:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_2", "op": "Sub", "input": ["add:z:0", "truediv_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_1", "op": "Sub", "input": ["mul_5:z:0", "truediv_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sum_2", "op": "Sum", "input": ["sub_1:z:0", "__inference_while_body_478_120_frozen/Sum_1/reduction_indices:output:0"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Sum_3", "op": "Sum", "input": ["Sum_2:output:0", "__inference_while_body_478_120_frozen/ExpandDims_8/dim:output:0"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "truediv_3", "op": "RealDiv", "input": ["Sum_3:output:0", "sub:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "AddV2", "input": ["__inference_while_body_478_120_frozen/add_1/y:output:0", "truediv_3:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_2", "op": "AddV2", "input": ["add_1:z:0", "truediv_4:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_5", "op": "RealDiv", "input": ["sub_2:z:0", "add_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}], "ret": {"identity_1": "while_maximum_iterations", "identity_2": "truediv_5:z:0", "identity_3": "Sum:output:0", "identity_4": "Exp:y:0", "identity_5": "sub_2:z:0", "identity": "add_3:z:0", "identity_6": "sub:z:0", "shape_c_mat_sn": "shape_c_mat_sn_0", "expanddims_6_val_mat_sd": "expanddims_6_val_mat_sd_0", "shape_2_l_mat_sd": "shape_2_l_mat_sd_0"}}, {"signature": {"name": "__inference_cond_true_496_257_frozen", "inputArg": [{"name": "norm_mul_placeholder", "type": "DT_FLOAT"}, {"name": "placeholder", "type": "DT_BOOL"}], "outputArg": [{"name": "identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "__inference_cond_true_496_257_frozen/norm/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "__inference_cond_true_496_257_frozen/Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "op": "Square", "input": ["norm_mul_placeholder"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "norm/Sum", "op": "Sum", "input": ["norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul:y:0", "__inference_cond_true_496_257_frozen/norm/Const:output:0"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "norm/Sqrt", "op": "Sqrt", "input": ["norm/Sum:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "norm/Squeeze", "op": "Squeeze", "input": ["norm/Sqrt:y:0"], "attr": {"squeeze_dims": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Greater", "op": "Greater", "input": ["norm/Squeeze:output:0", "__inference_cond_true_496_257_frozen/Greater/y:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}], "ret": {"identity": "Greater:z:0"}}, {"signature": {"name": "__inference_while_body_155_245_frozen", "inputArg": [{"name": "while_loop_counter", "type": "DT_INT32"}, {"name": "while_maximum_iterations", "type": "DT_INT32"}, {"name": "placeholder", "type": "DT_FLOAT"}, {"name": "placeholder_1", "type": "DT_FLOAT"}, {"name": "placeholder_2", "type": "DT_FLOAT"}, {"name": "placeholder_3", "type": "DT_FLOAT"}, {"name": "placeholder_4", "type": "DT_FLOAT"}, {"name": "shape_c_mat_sn_0", "type": "DT_FLOAT"}, {"name": "shape_2_l_mat_sd_0", "type": "DT_FLOAT"}, {"name": "expanddims_6_val_mat_sd_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "identity", "type": "DT_INT32"}, {"name": "identity_1", "type": "DT_INT32"}, {"name": "identity_2", "type": "DT_FLOAT"}, {"name": "identity_3", "type": "DT_FLOAT"}, {"name": "identity_4", "type": "DT_FLOAT"}, {"name": "identity_5", "type": "DT_FLOAT"}, {"name": "identity_6", "type": "DT_FLOAT"}, {"name": "shape_c_mat_sn", "type": "DT_FLOAT"}, {"name": "shape_2_l_mat_sd", "type": "DT_FLOAT"}, {"name": "expanddims_6_val_mat_sd", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_while_body_155_245_frozen/mul_6/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_155_245_frozen/Sum_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_while_body_155_245_frozen/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_155_245_frozen/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "__inference_while_body_155_245_frozen/ExpandDims_8/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_155_245_frozen/Sum_4/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_155_245_frozen/truediv_4/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_155_245_frozen/ExpandDims_9/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "sub", "op": "Sub", "input": ["placeholder_4", "placeholder"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Shape_2", "op": "Shape", "input": ["shape_2_l_mat_sd_0"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "ExpandDims_9", "op": "ExpandDims", "input": ["expanddims_6_val_mat_sd_0", "__inference_while_body_155_245_frozen/ExpandDims_9/dim:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_7", "op": "ExpandDims", "input": ["shape_2_l_mat_sd_0", "__inference_while_body_155_245_frozen/ExpandDims_9/dim:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_3", "op": "AddV2", "input": ["__inference_while_body_155_245_frozen/ExpandDims_9/dim:output:0", "while_loop_counter"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "pow_1", "op": "Square", "input": ["sub:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Log", "op": "Log", "input": ["sub:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_2", "op": "RealDiv", "input": ["__inference_while_body_155_245_frozen/truediv_4/x:output:0", "sub:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_2", "op": "StridedSlice", "input": ["Shape_2:output:0", "__inference_while_body_155_245_frozen/strided_slice_2/stack:output:0", "__inference_while_body_155_245_frozen/strided_slice_2/stack_1:output:0", "__inference_while_body_155_245_frozen/strided_slice_2/stack:output:0"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "pow", "op": "Square", "input": ["ExpandDims_9:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_3", "op": "Mul", "input": ["ExpandDims_7:output:0", "ExpandDims_9:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_4", "op": "RealDiv", "input": ["__inference_while_body_155_245_frozen/truediv_4/x:output:0", "pow_1:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims", "op": "ExpandDims", "input": ["Log:y:0", "__inference_while_body_155_245_frozen/ExpandDims_9/dim:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "Tile/multiples", "op": "Pack", "input": ["__inference_while_body_155_245_frozen/ExpandDims_9/dim:output:0", "strided_slice_2:output:0"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "Tile", "op": "Tile", "input": ["ExpandDims:output:0", "Tile/multiples:output:0"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Cumsum", "op": "Cumsum", "input": ["Tile:output:0", "__inference_while_body_155_245_frozen/ExpandDims_9/dim:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "exclusive": {"b": true}, "reverse": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Exp", "op": "Exp", "input": ["Cumsum:out:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_8", "op": "ExpandDims", "input": ["Exp:y:0", "__inference_while_body_155_245_frozen/ExpandDims_8/dim:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_4", "op": "Mul", "input": ["ExpandDims_8:output:0", "mul_3:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_1", "op": "Mul", "input": ["ExpandDims_7:output:0", "ExpandDims_8:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sum_1", "op": "Sum", "input": ["mul_4:z:0", "__inference_while_body_155_245_frozen/Sum_1/reduction_indices:output:0"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Sum", "op": "Sum", "input": ["mul_1:z:0", "__inference_while_body_155_245_frozen/Sum_1/reduction_indices:output:0"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_11", "op": "ExpandDims", "input": ["Sum_1:output:0", "__inference_while_body_155_245_frozen/Sum_1/reduction_indices:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_12", "op": "ExpandDims", "input": ["Sum:output:0", "__inference_while_body_155_245_frozen/Sum_1/reduction_indices:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "truediv", "op": "RealDiv", "input": ["shape_c_mat_sn_0", "Sum:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_5", "op": "ExpandDims", "input": ["truediv:z:0", "__inference_while_body_155_245_frozen/Sum_1/reduction_indices:output:0"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_2", "op": "Mul", "input": ["ExpandDims_5:output:0", "mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_5", "op": "Mul", "input": ["mul_2:z:0", "pow:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_6", "op": "Mul", "input": ["mul_2:z:0", "__inference_while_body_155_245_frozen/mul_6/x:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_9", "op": "Mul", "input": ["ExpandDims_9:output:0", "mul_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_7", "op": "Mul", "input": ["ExpandDims_9:output:0", "mul_6:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sum_4", "op": "Sum", "input": ["mul_9:z:0", "__inference_while_body_155_245_frozen/Sum_4/reduction_indices:output:0"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_8", "op": "Mul", "input": ["ExpandDims_11:output:0", "mul_7:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "AddV2", "input": ["Sum_4:output:0", "sub:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_1", "op": "RealDiv", "input": ["mul_8:z:0", "ExpandDims_12:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_2", "op": "Sub", "input": ["add:z:0", "truediv_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_1", "op": "Sub", "input": ["mul_5:z:0", "truediv_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Sum_2", "op": "Sum", "input": ["sub_1:z:0", "__inference_while_body_155_245_frozen/Sum_1/reduction_indices:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Sum_3", "op": "Sum", "input": ["Sum_2:output:0", "__inference_while_body_155_245_frozen/ExpandDims_8/dim:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "truediv_3", "op": "RealDiv", "input": ["Sum_3:output:0", "sub:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "AddV2", "input": ["__inference_while_body_155_245_frozen/mul_6/x:output:0", "truediv_3:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_2", "op": "AddV2", "input": ["add_1:z:0", "truediv_4:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_5", "op": "RealDiv", "input": ["sub_2:z:0", "add_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}], "ret": {"identity_1": "while_maximum_iterations", "identity_2": "truediv_5:z:0", "identity_3": "Sum:output:0", "identity_4": "Exp:y:0", "identity": "add_3:z:0", "identity_5": "sub_2:z:0", "identity_6": "sub:z:0", "shape_c_mat_sn": "shape_c_mat_sn_0", "expanddims_6_val_mat_sd": "expanddims_6_val_mat_sd_0", "shape_2_l_mat_sd": "shape_2_l_mat_sd_0"}}, {"signature": {"name": "__inference_while_cond_477_301_frozen", "inputArg": [{"name": "while_loop_counter", "type": "DT_INT32"}, {"name": "while_maximum_iterations", "type": "DT_INT32"}, {"name": "placeholder", "type": "DT_FLOAT"}, {"name": "placeholder_1", "type": "DT_FLOAT"}, {"name": "placeholder_2", "type": "DT_FLOAT"}, {"name": "placeholder_3", "type": "DT_FLOAT"}, {"name": "placeholder_4", "type": "DT_FLOAT"}, {"name": "while_cond_477___redundant_placeholder0", "type": "DT_FLOAT"}, {"name": "while_cond_477___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "while_cond_477___redundant_placeholder2", "type": "DT_FLOAT"}], "outputArg": [{"name": "identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "__inference_while_cond_477_301_frozen/norm/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_cond_477_301_frozen/Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "op": "Square", "input": ["placeholder_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "norm/Sum", "op": "Sum", "input": ["norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul:y:0", "__inference_while_cond_477_301_frozen/norm/Const:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "norm/Sqrt", "op": "Sqrt", "input": ["norm/Sum:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "norm/Squeeze", "op": "Squeeze", "input": ["norm/Sqrt:y:0"], "attr": {"squeeze_dims": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Greater", "op": "Greater", "input": ["norm/Squeeze:output:0", "__inference_while_cond_477_301_frozen/Greater/y:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "cond", "op": "StatelessIf", "input": ["Greater:z:0", "placeholder", "Greater:z:0"], "attr": {"then_branch": {"func": {"name": "__inference_cond_true_496_257_frozen"}}, "Tcond": {"type": "DT_BOOL"}, "Tin": {"list": {"type": ["DT_FLOAT", "DT_BOOL"]}}, "else_branch": {"func": {"name": "__inference_cond_false_497_279_frozen"}}, "output_shapes": {"list": {"shape": [{}]}}, "_lower_using_switch_merge": {"b": false}, "_read_only_resource_inputs": {"list": {}}, "Tout": {"list": {"type": ["DT_BOOL"]}}}}], "ret": {"identity": "cond:output:0"}}, {"signature": {"name": "__inference_cond_true_173_471_frozen", "inputArg": [{"name": "norm_mul_placeholder", "type": "DT_FLOAT"}, {"name": "cond_placeholder_4", "type": "DT_FLOAT"}, {"name": "placeholder", "type": "DT_BOOL"}], 