{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1", "userDefinedMetadata": {"signature": {"inputs": {"dx:0": {"name": "dx:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "alpha_s:0": {"name": "alpha_s:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "concentration_sx:0": {"name": "concentration_sx:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dt:0": {"name": "dt:0", "dtype": "DT_FLOAT", "tensorShape": {}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}}, "modelTopology": {"node": [{"name": "ConstantFolding/PartitionedCall/truediv_20_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_17/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_6/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/mul_23/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/strided_slice_18/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/strided_slice_16/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/strided_slice_18/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice_18/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/mul_29/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "alpha_s", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "concentration_sx", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "dt", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "dx", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_17", "op": "StridedSlice", "input": ["alpha_s", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "2"}, "end_mask": {"i": "1"}}}, {"name": "PartitionedCall/Max_3", "op": "Max", "input": ["alpha_s", "PartitionedCall/Const_3"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["concentration_sx", "PartitionedCall/strided_slice_16/stack", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["concentration_sx", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_1", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "PartitionedCall/mul_14", "op": "Mul", "input": ["PartitionedCall/mul_23/y", "dt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_23", "op": "Mul", "input": ["PartitionedCall/mul_23/y", "PartitionedCall/strided_slice_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_25", "op": "Mul", "input": ["PartitionedCall/Max_3", "PartitionedCall/mul_23/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_1", "op": "Sum", "input": ["PartitionedCall/strided_slice_1", "PartitionedCall/Sum_6/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/Sum", "op": "Sum", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Sum_6/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/strided_slice_1", "PartitionedCall/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_3", "op": "RealDiv", "input": ["PartitionedCall/truediv_17/x", "PartitionedCall/Sum_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_1", "op": "RealDiv", "input": ["PartitionedCall/strided_slice_1", "PartitionedCall/Sum_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_2", "op": "RealDiv", "input": ["PartitionedCall/truediv_17/x", "PartitionedCall/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv", "op": "RealDiv", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_1", "op": "AddV2", "input": ["PartitionedCall/truediv_2", "PartitionedCall/truediv_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/truediv", "PartitionedCall/truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/add_1", "PartitionedCall/mul_25"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/add", "PartitionedCall/mul_23"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Abs", "op": "Abs", "input": ["PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_4", "op": "Mul", "input": ["PartitionedCall/Abs", "PartitionedCall/mul_23/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_5", "op": "Mul", "input": ["PartitionedCall/mul_4", "PartitionedCall/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_1", "op": "Sub", "input": ["PartitionedCall/mul_1", "PartitionedCall/mul_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_3", "op": "StridedSlice", "input": ["PartitionedCall/sub_1", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_1", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "PartitionedCall/strided_slice_4", "op": "StridedSlice", "input": ["PartitionedCall/sub_1", "PartitionedCall/strided_slice_16/stack", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"end_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/sub_2", "op": "Sub", "input": ["PartitionedCall/strided_slice_3", "PartitionedCall/strided_slice_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_4", "op": "RealDiv", "input": ["PartitionedCall/sub_2", "dx"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Pad", "op": "Pad", "input": ["PartitionedCall/truediv_4", "PartitionedCall/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_7", "op": "Mul", "input": ["PartitionedCall/Pad", "PartitionedCall/mul_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_2", "op": "AddV2", "input": ["PartitionedCall/mul_7", "concentration_sx"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_6", "op": "StridedSlice", "input": ["PartitionedCall/add_2", "PartitionedCall/strided_slice_16/stack", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice_5", "op": "StridedSlice", "input": ["PartitionedCall/add_2", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_1", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_3", "op": "Sum", "input": ["PartitionedCall/strided_slice_6", "PartitionedCall/Sum_6/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_2", "op": "Sum", "input": ["PartitionedCall/strided_slice_5", "PartitionedCall/Sum_6/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/sub_3", "op": "Sub", "input": ["PartitionedCall/strided_slice_6", "PartitionedCall/strided_slice_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_8", "op": "RealDiv", "input": ["PartitionedCall/truediv_17/x", "PartitionedCall/Sum_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_6", "op": "RealDiv", "input": ["PartitionedCall/strided_slice_6", "PartitionedCall/Sum_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_7", "op": "RealDiv", "input": ["PartitionedCall/truediv_17/x", "PartitionedCall/Sum_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_5", "op": "RealDiv", "input": ["PartitionedCall/strided_slice_5", "PartitionedCall/Sum_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_4", "op": "AddV2", "input": ["PartitionedCall/truediv_7", "PartitionedCall/truediv_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_3", "op": "AddV2", "input": ["PartitionedCall/truediv_5", "PartitionedCall/truediv_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_11", "op": "Mul", "input": ["PartitionedCall/add_4", "PartitionedCall/mul_25"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_9", "op": "Mul", "input": ["PartitionedCall/add_3", "PartitionedCall/mul_23"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Abs_1", "op": "Abs", "input": ["PartitionedCall/mul_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_12", "op": "Mul", "input": ["PartitionedCall/Abs_1", "PartitionedCall/mul_23/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_13", "op": "Mul", "input": ["PartitionedCall/mul_12", "PartitionedCall/sub_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_4", "op": "Sub", "input": ["PartitionedCall/mul_9", "PartitionedCall/mul_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_8", "op": "StridedSlice", "input": ["PartitionedCall/sub_4", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_1", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "PartitionedCall/strided_slice_9", "op": "StridedSlice", "input": ["PartitionedCall/sub_4", "PartitionedCall/strided_slice_16/stack", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sub_5", "op": "Sub", "input": ["PartitionedCall/strided_slice_8", "PartitionedCall/strided_slice_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_9", "op": "RealDiv", "input": ["PartitionedCall/sub_5", "dx"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Pad_1", "op": "Pad", "input": ["PartitionedCall/truediv_9", "PartitionedCall/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_29", "op": "Mul", "input": ["PartitionedCall/Pad_1", "PartitionedCall/mul_29/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_15", "op": "Mul", "input": ["PartitionedCall/Pad_1", "PartitionedCall/mul_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_11", "op": "AddV2", "input": ["PartitionedCall/Pad", "PartitionedCall/mul_29"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_5", "op": "AddV2", "input": ["PartitionedCall/mul_15", "concentration_sx"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_11", "op": "StridedSlice", "input": ["PartitionedCall/add_5", "PartitionedCall/strided_slice_16/stack", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "3"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_10", "op": "StridedSlice", "input": ["PartitionedCall/add_5", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_1", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Sum_5", "op": "Sum", "input": ["PartitionedCall/strided_slice_11", "PartitionedCall/Sum_6/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_4", "op": "Sum", "input": ["PartitionedCall/strided_slice_10", "PartitionedCall/Sum_6/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/sub_6", "op": "Sub", "input": ["PartitionedCall/strided_slice_11", "PartitionedCall/strided_slice_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_13", "op": "RealDiv", "input": ["PartitionedCall/truediv_17/x", "PartitionedCall/Sum_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_11", "op": "RealDiv", "input": ["PartitionedCall/strided_slice_11", "PartitionedCall/Sum_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_12", "op": "RealDiv", "input": ["PartitionedCall/truediv_17/x", "PartitionedCall/Sum_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_10", "op": "RealDiv", "input": ["PartitionedCall/strided_slice_10", "PartitionedCall/Sum_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_7", "op": "AddV2", "input": ["PartitionedCall/truediv_12", "PartitionedCall/truediv_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_6", "op": "AddV2", "input": ["PartitionedCall/truediv_10", "PartitionedCall/truediv_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_19", "op": "Mul", "input": ["PartitionedCall/add_7", "PartitionedCall/mul_25"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_17", "op": "Mul", "input": ["PartitionedCall/add_6", "PartitionedCall/mul_23"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Abs_2", "op": "Abs", "input": ["PartitionedCall/mul_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_20", "op": "Mul", "input": ["PartitionedCall/Abs_2", "PartitionedCall/mul_23/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_21", "op": "Mul", "input": ["PartitionedCall/mul_20", "PartitionedCall/sub_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_7", "op": "Sub", "input": ["PartitionedCall/mul_17", "PartitionedCall/mul_21"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_13", "op": "StridedSlice", "input": ["PartitionedCall/sub_7", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_1", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "PartitionedCall/strided_slice_14", "op": "StridedSlice", "input": ["PartitionedCall/sub_7", "PartitionedCall/strided_slice_16/stack", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"end_mask": {"i": "3"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/sub_8", "op": "Sub", "input": ["PartitionedCall/strided_slice_13", "PartitionedCall/strided_slice_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_14", "op": "RealDiv", "input": ["PartitionedCall/sub_8", "dx"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Pad_2", "op": "Pad", "input": ["PartitionedCall/truediv_14", "PartitionedCall/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/mul_22", "op": "Mul", "input": ["PartitionedCall/Pad_2", "dt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_30", "op": "Mul", "input": ["PartitionedCall/Pad_2", "PartitionedCall/mul_29/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_8", "op": "AddV2", "input": ["PartitionedCall/mul_22", "concentration_sx"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_12", "op": "AddV2", "input": ["PartitionedCall/add_11", "PartitionedCall/mul_30"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_16", "op": "StridedSlice", "input": ["PartitionedCall/add_8", "PartitionedCall/strided_slice_16/stack", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "3"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_15", "op": "StridedSlice", "input": ["PartitionedCall/add_8", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_1", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "PartitionedCall/Sum_7", "op": "Sum", "input": ["PartitionedCall/strided_slice_16", "PartitionedCall/Sum_6/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/Sum_6", "op": "Sum", "input": ["PartitionedCall/strided_slice_15", "PartitionedCall/Sum_6/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/sub_9", "op": "Sub", "input": ["PartitionedCall/strided_slice_16", "PartitionedCall/strided_slice_15"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_18", "op": "RealDiv", "input": ["PartitionedCall/truediv_17/x", "PartitionedCall/Sum_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_16", "op": "RealDiv", "input": ["PartitionedCall/strided_slice_16", "PartitionedCall/Sum_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_17", "op": "RealDiv", "input": ["PartitionedCall/truediv_17/x", "PartitionedCall/Sum_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_15", "op": "RealDiv", "input": ["PartitionedCall/strided_slice_15", "PartitionedCall/Sum_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_10", "op": "AddV2", "input": ["PartitionedCall/truediv_17", "PartitionedCall/truediv_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_9", "op": "AddV2", "input": ["PartitionedCall/truediv_15", "PartitionedCall/truediv_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_26", "op": "Mul", "input": ["PartitionedCall/add_10", "PartitionedCall/mul_25"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_24", "op": "Mul", "input": ["PartitionedCall/add_9", "PartitionedCall/mul_23"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Abs_3", "op": "Abs", "input": ["PartitionedCall/mul_26"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_27", "op": "Mul", "input": ["PartitionedCall/Abs_3", "PartitionedCall/mul_23/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_28", "op": "Mul", "input": ["PartitionedCall/mul_27", "PartitionedCall/sub_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_10", "op": "Sub", "input": ["PartitionedCall/mul_24", "PartitionedCall/mul_28"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_18", "op": "StridedSlice", "input": ["PartitionedCall/sub_10", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_1", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice_19", "op": "StridedSlice", "input": ["PartitionedCall/sub_10", "PartitionedCall/strided_slice_16/stack", "PartitionedCall/strided_slice_18/stack", "PartitionedCall/strided_slice_18/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "3"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_11", "op": "Sub", "input": ["PartitionedCall/strided_slice_18", "PartitionedCall/strided_slice_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_19", "op": "RealDiv", "input": ["PartitionedCall/sub_11", "dx"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Pad_3", "op": "Pad", "input": ["PartitionedCall/truediv_19", "PartitionedCall/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_13", "op": "AddV2", "input": ["PartitionedCall/Pad_3", "PartitionedCall/add_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_31", "op": "Mul", "input": ["ConstantFolding/PartitionedCall/truediv_20_recip", "PartitionedCall/add_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_20", "op": "Mul", "input": ["PartitionedCall/mul_31", "dt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_14", "op": "AddV2", "input": ["PartitionedCall/truediv_20", "concentration_sx"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/add_14"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "ConstantFolding/PartitionedCall/truediv_20_recip", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/truediv_17/x", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/Sum_6/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/Const_3", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/mul_23/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/strided_slice_18/stack_1", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/strided_slice_16/stack", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/strided_slice_18/stack", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/strided_slice_18/stack_2", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/Pad/paddings", "shape": [2, 2], "dtype": "int32"}, {"name": "PartitionedCall/mul_29/x", "shape": [], "dtype": "float32"}]}]}