{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "signature": {"inputs": {"val_mat_sd:0": {"name": "val_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "c_mat_sn:0": {"name": "c_mat_sn:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "current:0": {"name": "current:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "cH_n": {"name": "ch_n:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "l_mat_sd:0": {"name": "l_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "d_mat_sd:0": {"name": "d_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dt:0": {"name": "dt:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "dx:0": {"name": "dx:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "u_mat_sd:0": {"name": "u_mat_sd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "tolerance:0": {"name": "tolerance:0", "dtype": "DT_FLOAT", "tensorShape": {}}}, "outputs": {"Identity_3:0": {"name": "Identity_3:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "Identity_4:0": {"name": "Identity_4:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "output_2": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/strided_slice_7/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/strided_slice_5/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/strided_slice_6/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/mul_32/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/mul_27/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_22/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/mul_30/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_26/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_12/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/Sum_9/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/PartitionedCall/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/truediv_7/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice_5/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/ExpandDims_33/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Sum_12/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "c_mat_sn", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "ch_n", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "current", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "d_mat_sd", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "dt", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dx", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "l_mat_sd", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "tolerance", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "u_mat_sd", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "val_mat_sd", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "PartitionedCall/truediv", "op": "Mul", "input": ["ConstantFolding/PartitionedCall/truediv_recip", "c_mat_sn"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_2", "op": "RealDiv", "input": ["PartitionedCall/truediv_7/x", "ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Log", "op": "Log", "input": ["ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/pow_1", "op": "Square", "input": ["ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_32", "op": "ExpandDims", "input": ["d_mat_sd", "PartitionedCall/ExpandDims_33/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_33", "op": "Mul", "input": ["PartitionedCall/mul_32/x", "dx"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_17", "op": "ExpandDims", "input": ["l_mat_sd", "PartitionedCall/ExpandDims_33/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Shape", "op": "Shape", "input": ["l_mat_sd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/add_10", "op": "AddV2", "input": ["PartitionedCall/Const", "tolerance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_31", "op": "ExpandDims", "input": ["u_mat_sd", "PartitionedCall/ExpandDims_33/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_33", "op": "ExpandDims", "input": ["val_mat_sd", "PartitionedCall/ExpandDims_33/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/Log", "PartitionedCall/ExpandDims_33/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_4", "op": "RealDiv", "input": ["PartitionedCall/truediv_7/x", "PartitionedCall/pow_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Shape", "PartitionedCall/strided_slice_5/stack", "PartitionedCall/strided_slice_3/stack_1", "PartitionedCall/strided_slice_5/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "PartitionedCall/pow_2", "op": "Square", "input": ["PartitionedCall/ExpandDims_33"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_12", "op": "Mul", "input": ["PartitionedCall/ExpandDims_17", "PartitionedCall/ExpandDims_33"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/ExpandDims_33/dim", "PartitionedCall/strided_slice"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Tile", "op": "Tile", "input": ["PartitionedCall/ExpandDims", "PartitionedCall/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Cumsum", "op": "Cumsum", "input": ["PartitionedCall/Tile", "PartitionedCall/ExpandDims_33/dim"], "attr": {"reverse": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "exclusive": {"b": true}}}, {"name": "PartitionedCall/Exp", "op": "Exp", "input": ["PartitionedCall/Cumsum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_4", "op": "ExpandDims", "input": ["PartitionedCall/Exp", "PartitionedCall/concat_1/axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/ExpandDims_17", "PartitionedCall/ExpandDims_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_4", "op": "Mul", "input": ["PartitionedCall/ExpandDims_4", "PartitionedCall/mul_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum", "op": "Sum", "input": ["PartitionedCall/mul_1", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Sum_1", "op": "Sum", "input": ["PartitionedCall/mul_4", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/div_no_nan", "op": "DivNoNan", "input": ["PartitionedCall/truediv", "PartitionedCall/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_12", "op": "ExpandDims", "input": ["PartitionedCall/Sum", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_11", "op": "ExpandDims", "input": ["PartitionedCall/Sum_1", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_5", "op": "ExpandDims", "input": ["PartitionedCall/div_no_nan", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/ExpandDims_5", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_5", "op": "Mul", "input": ["PartitionedCall/mul_2", "PartitionedCall/pow_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_8", "op": "Mul", "input": ["PartitionedCall/ExpandDims_33", "PartitionedCall/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_4", "op": "Sum", "input": ["PartitionedCall/mul_8", "PartitionedCall/Sum_9/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/mul_7", "op": "Mul", "input": ["PartitionedCall/ExpandDims_11", "PartitionedCall/mul_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/Sum_4", "ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_1", "op": "RealDiv", "input": ["PartitionedCall/mul_7", "PartitionedCall/ExpandDims_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_1", "op": "Sub", "input": ["PartitionedCall/add", "PartitionedCall/truediv_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul_5", "PartitionedCall/truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_2", "op": "Sum", "input": ["PartitionedCall/sub", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/Sum_3", "op": "Sum", "input": ["PartitionedCall/Sum_2", "PartitionedCall/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/truediv_3", "op": "RealDiv", "input": ["PartitionedCall/Sum_3", "ch_n"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_1", "op": "AddV2", "input": ["PartitionedCall/Const", "PartitionedCall/truediv_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_2", "op": "AddV2", "input": ["PartitionedCall/add_1", "PartitionedCall/truediv_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_5", "op": "RealDiv", "input": ["PartitionedCall/sub_1", "PartitionedCall/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_2", "op": "Sub", "input": ["ch_n", "PartitionedCall/truediv_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_7", "op": "RealDiv", "input": ["PartitionedCall/truediv_7/x", "PartitionedCall/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/pow_3", "op": "Square", "input": ["PartitionedCall/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Log_1", "op": "Log", "input": ["PartitionedCall/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_9", "op": "RealDiv", "input": ["PartitionedCall/truediv_7/x", "PartitionedCall/pow_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_14", "op": "ExpandDims", "input": ["PartitionedCall/Log_1", "PartitionedCall/ExpandDims_33/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Tile_1", "op": "Tile", "input": ["PartitionedCall/ExpandDims_14", "PartitionedCall/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Cumsum_1", "op": "Cumsum", "input": ["PartitionedCall/Tile_1", "PartitionedCall/ExpandDims_33/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "reverse": {"b": false}, "exclusive": {"b": true}}}, {"name": "PartitionedCall/Exp_1", "op": "Exp", "input": ["PartitionedCall/Cumsum_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_18", "op": "ExpandDims", "input": ["PartitionedCall/Exp_1", "PartitionedCall/concat_1/axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_13", "op": "Mul", "input": ["PartitionedCall/ExpandDims_18", "PartitionedCall/mul_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_10", "op": "Mul", "input": ["PartitionedCall/ExpandDims_17", "PartitionedCall/ExpandDims_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_6", "op": "Sum", "input": ["PartitionedCall/mul_13", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/Sum_5", "op": "Sum", "input": ["PartitionedCall/mul_10", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_25", "op": "ExpandDims", "input": ["PartitionedCall/Sum_6", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/div_no_nan_1", "op": "DivNoNan", "input": ["PartitionedCall/truediv", "PartitionedCall/Sum_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/ExpandDims_26", "op": "ExpandDims", "input": ["PartitionedCall/Sum_5", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/ExpandDims_19", "op": "ExpandDims", "input": ["PartitionedCall/div_no_nan_1", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_11", "op": "RealDiv", "input": ["PartitionedCall/mul_10", "PartitionedCall/ExpandDims_26"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_11", "op": "Mul", "input": ["PartitionedCall/ExpandDims_19", "PartitionedCall/mul_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_19", "op": "Mul", "input": ["PartitionedCall/ExpandDims_31", "PartitionedCall/truediv_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_20", "op": "Mul", "input": ["PartitionedCall/ExpandDims_32", "PartitionedCall/truediv_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_14", "op": "Mul", "input": ["PartitionedCall/mul_11", "PartitionedCall/pow_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_17", "op": "Mul", "input": ["PartitionedCall/ExpandDims_33", "PartitionedCall/mul_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_10", "op": "Sum", "input": ["PartitionedCall/mul_19", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/mul_21", "op": "Mul", "input": ["PartitionedCall/ExpandDims_33", "PartitionedCall/mul_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_11", "op": "Sum", "input": ["PartitionedCall/mul_20", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/mul_23", "op": "Mul", "input": ["PartitionedCall/ExpandDims_33", "PartitionedCall/mul_20"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_9", "op": "Sum", "input": ["PartitionedCall/mul_17", "PartitionedCall/Sum_9/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/mul_16", "op": "Mul", "input": ["PartitionedCall/ExpandDims_25", "PartitionedCall/mul_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_12", "op": "Sum", "input": ["PartitionedCall/mul_21", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/Sum_13", "op": "Sum", "input": ["PartitionedCall/mul_23", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_3", "op": "AddV2", "input": ["PartitionedCall/Sum_9", "PartitionedCall/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_6", "op": "RealDiv", "input": ["PartitionedCall/mul_16", "PartitionedCall/ExpandDims_26"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_22", "op": "Mul", "input": ["PartitionedCall/Sum_12", "PartitionedCall/mul_22/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_24", "op": "Mul", "input": ["PartitionedCall/Sum_13", "PartitionedCall/mul_22/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_4", "op": "Sub", "input": ["PartitionedCall/add_3", "PartitionedCall/truediv_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_3", "op": "Sub", "input": ["PartitionedCall/mul_14", "PartitionedCall/truediv_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_25", "op": "Mul", "input": ["PartitionedCall/mul_22", "c_mat_sn"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_28", "op": "Mul", "input": ["PartitionedCall/mul_24", "c_mat_sn"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_7", "op": "Sum", "input": ["PartitionedCall/sub_3", "PartitionedCall/Sum_12/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Sum_14", "op": "Sum", "input": ["PartitionedCall/mul_25", "PartitionedCall/concat_1/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/Sum_15", "op": "Sum", "input": ["PartitionedCall/mul_28", "PartitionedCall/concat_1/axis"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sum_8", "op": "Sum", "input": ["PartitionedCall/Sum_7", "PartitionedCall/concat_1/axis"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/truediv_8", "op": "RealDiv", "input": ["PartitionedCall/Sum_8", "PartitionedCall/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_4", "op": "AddV2", "input": ["PartitionedCall/Const", "PartitionedCall/truediv_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_5", "op": "AddV2", "input": ["PartitionedCall/add_4", "PartitionedCall/truediv_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_10", "op": "RealDiv", "input": ["PartitionedCall/sub_4", "PartitionedCall/add_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_5", "op": "Sub", "input": ["PartitionedCall/sub_2", "PartitionedCall/truediv_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/sub_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_26", "op": "Mul", "input": ["PartitionedCall/mul_26/x", "PartitionedCall/sub_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_12", "op": "RealDiv", "input": ["PartitionedCall/truediv_12/x", "PartitionedCall/sub_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_6", "op": "AddV2", "input": ["PartitionedCall/mul_26", "PartitionedCall/truediv_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_6", "op": "Sub", "input": ["PartitionedCall/mul_26", "PartitionedCall/truediv_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_27", "op": "Mul", "input": ["PartitionedCall/add_6", "PartitionedCall/mul_27/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_30", "op": "Mul", "input": ["PartitionedCall/mul_30/x", "PartitionedCall/sub_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_7", "op": "AddV2", "input": ["PartitionedCall/Sum_14", "PartitionedCall/mul_27"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_8", "op": "AddV2", "input": ["PartitionedCall/Sum_15", "PartitionedCall/mul_30"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_5", "op": "StridedSlice", "input": ["PartitionedCall/add_8", "PartitionedCall/strided_slice_5/stack", "PartitionedCall/strided_slice_5/stack_1", "PartitionedCall/strided_slice_5/stack"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_6", "op": "StridedSlice", "input": ["PartitionedCall/add_8", "PartitionedCall/strided_slice_6/stack", "PartitionedCall/strided_slice_5/stack_1", "PartitionedCall/strided_slice_5/stack"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}}}, {"name": "PartitionedCall/strided_slice_7", "op": "StridedSlice", "input": ["PartitionedCall/add_8", "PartitionedCall/strided_slice_7/stack", "PartitionedCall/strided_slice_6/stack", "PartitionedCall/strided_slice_5/stack"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}}}, {"name": "PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/add_8", "PartitionedCall/strided_slice_5/stack_1", "PartitionedCall/strided_slice_5/stack", "PartitionedCall/strided_slice_5/stack"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/strided_slice_3", "op": "StridedSlice", "input": ["PartitionedCall/add_8", "PartitionedCall/strided_slice_5/stack", "PartitionedCall/strided_slice_3/stack_1", "PartitionedCall/strided_slice_5/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice_4", "op": "StridedSlice", "input": ["PartitionedCall/add_8", "PartitionedCall/strided_slice_5/stack_1", "PartitionedCall/strided_slice_6/stack", "PartitionedCall/strided_slice_5/stack"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}}}, {"name": "PartitionedCall/while", "op": "StatelessWhile", "input": ["PartitionedCall/concat_1/axis", "PartitionedCall/while/maximum_iterations", "PartitionedCall/Const", "c_mat_sn", "PartitionedCall/add_10", "dt", "tolerance", "c_mat_sn", "PartitionedCall/add_7", "PartitionedCall/add_8", "PartitionedCall/Sum_10", "current", "PartitionedCall/Sum_11", "dx"], "attr": {"cond": {"func": {"name": "__inference_while_cond_273_3898_frozen"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}]}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {}, {"dim": [{"size": "-1"}, {"size": "-1"}]}, {}]}}, "_read_only_resource_inputs": {"list": {}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "parallel_iterations": {"i": "10"}, "_lower_using_switch_merge": {"b": false}, "body": {"func": {"name": "__inference_while_body_274_3880_frozen"}}, "_num_original_outputs": {"i": "14"}}}, {"name": "PartitionedCall/mul_32", "op": "Mul", "input": ["PartitionedCall/mul_32/x", "PartitionedCall/strided_slice_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_31", "op": "Mul", "input": ["PartitionedCall/mul_32/x", "PartitionedCall/strided_slice_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["PartitionedCall/while:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_3", "op": "Identity", "input": ["PartitionedCall/while:5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_34", "op": "Mul", "input": ["PartitionedCall/while:2", "PartitionedCall/while:5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_8", "op": "Sub", "input": ["PartitionedCall/mul_32", "PartitionedCall/strided_slice_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub_7", "op": "Sub", "input": ["PartitionedCall/mul_31", "PartitionedCall/strided_slice_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_4", "op": "Identity", "input": ["PartitionedCall/mul_34"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/PartitionedCall/concat_1/values_1_const_axis", "op": "Const", "input": ["^PartitionedCall/sub_8"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/PartitionedCall/concat/values_0_const_axis", "op": "Const", "input": ["^PartitionedCall/sub_7"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/concat_1/values_1", "op": "ExpandDims", "input": ["PartitionedCall/sub_8", "ConstantFolding/PartitionedCall/concat_1/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/concat/values_0", "op": "ExpandDims", "input": ["PartitionedCall/sub_7", "ConstantFolding/PartitionedCall/concat/values_0_const_axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/concat_1", "op": "ConcatV2", "input": ["PartitionedCall/strided_slice_5", "PartitionedCall/concat_1/values_1", "PartitionedCall/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/concat", "op": "ConcatV2", "input": ["PartitionedCall/concat/values_0", "PartitionedCall/strided_slice_4", "PartitionedCall/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/sub_9", "op": "Sub", "input": ["PartitionedCall/concat_1", "PartitionedCall/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_14", "op": "RealDiv", "input": ["PartitionedCall/sub_9", "PartitionedCall/mul_33"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_9", "op": "AddV2", "input": ["PartitionedCall/truediv_14", "current"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/truediv_15", "op": "RealDiv", "input": ["PartitionedCall/add_9", "PartitionedCall/add_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["PartitionedCall/truediv_15"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_while_cond_273_3898_frozen", "inputArg": [{"name": "while_loop_counter", "type": "DT_INT32"}, {"name": "while_maximum_iterations", "type": "DT_INT32"}, {"name": "placeholder", "type": "DT_FLOAT"}, {"name": "placeholder_1", "type": "DT_FLOAT"}, {"name": "placeholder_2", "type": "DT_FLOAT"}, {"name": "placeholder_3", "type": "DT_FLOAT"}, {"name": "greater_tolerance", "type": "DT_FLOAT"}, {"name": "while_cond_273___redundant_placeholder0", "type": "DT_FLOAT"}, {"name": "while_cond_273___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "while_cond_273___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "while_cond_273___redundant_placeholder3", "type": "DT_FLOAT"}, {"name": "while_cond_273___redundant_placeholder4", "type": "DT_FLOAT"}, {"name": "while_cond_273___redundant_placeholder5", "type": "DT_FLOAT"}, {"name": "while_cond_273___redundant_placeholder6", "type": "DT_FLOAT"}], "outputArg": [{"name": "identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "Greater", "op": "Greater", "input": ["placeholder_2", "greater_tolerance"], "attr": {"T": {"type": "DT_FLOAT"}}}], "ret": {"identity": "Greater:z:0"}}, {"signature": {"name": "__inference_while_body_274_3880_frozen", "inputArg": [{"name": "while_loop_counter", "type": "DT_INT32"}, {"name": "while_maximum_iterations", "type": "DT_INT32"}, {"name": "placeholder", "type": "DT_FLOAT"}, {"name": "placeholder_1", "type": "DT_FLOAT"}, {"name": "placeholder_2", "type": "DT_FLOAT"}, {"name": "placeholder_3", "type": "DT_FLOAT"}, {"name": "tolerance_0", "type": "DT_FLOAT"}, {"name": "shape_c_mat_sn_0", "type": "DT_FLOAT"}, {"name": "expanddims_add_7_0", "type": "DT_FLOAT"}, {"name": "expanddims_1_add_8_0", "type": "DT_FLOAT"}, {"name": "mul_1_sum_10_0", "type": "DT_FLOAT"}, {"name": "mul_2_current_0", "type": "DT_FLOAT"}, {"name": "strided_slice_10_sum_11_0", "type": "DT_FLOAT"}, {"name": "truediv_4_dx_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "identity", "type": "DT_INT32"}, {"name": "identity_1", "type": "DT_INT32"}, {"name": "identity_2", "type": "DT_FLOAT"}, {"name": "identity_3", "type": "DT_FLOAT"}, {"name": "identity_4", "type": "DT_FLOAT"}, {"name": "identity_5", "type": "DT_FLOAT"}, {"name": "tolerance", "type": "DT_FLOAT"}, {"name": "shape_c_mat_sn", "type": "DT_FLOAT"}, {"name": "expanddims_add_7", "type": "DT_FLOAT"}, {"name": "expanddims_1_add_8", "type": "DT_FLOAT"}, {"name": "mul_1_sum_10", "type": "DT_FLOAT"}, {"name": "mul_2_current", "type": "DT_FLOAT"}, {"name": "strided_slice_10_sum_11", "type": "DT_FLOAT"}, {"name": "truediv_4_dx", "type": "DT_FLOAT"}]}, "nodeDef": [{"name": "__inference_while_body_274_3880_frozen/mul_134/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/clip_by_value/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_274_3880_frozen/clip_by_value/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/mul_127/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_274_3880_frozen/mul_129/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_274_3880_frozen/mul_130/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_274_3880_frozen/mul_131/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/mul_132/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_274_3880_frozen/mul_106/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/mul_128/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_274_3880_frozen/mul_108/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/mul_109/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/mul_110/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/mul_86/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/mul_87/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_274_3880_frozen/mul_88/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_274_3880_frozen/mul_89/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/mul_67/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_274_3880_frozen/mul_68/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_274_3880_frozen/mul_69/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/mul_49/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_274_3880_frozen/mul_50/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/mul_32/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_274_3880_frozen/mul_115/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/sub_164/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/strided_slice_188/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_while_body_274_3880_frozen/Pad_6/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_274_3880_frozen/strided_slice_172/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_while_body_274_3880_frozen/sub_170/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_274_3880_frozen/strided_slice_193/stack_1/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_274_3880_frozen/pow_7/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/mul_33/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/mul_51/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/mul_70/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/mul_90/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/mul_111/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_while_body_274_3880_frozen/strided_slice_169/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_274_3880_frozen/strided_slice_169/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_274_3880_frozen/strided_slice_172/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_while_body_274_3880_frozen/mul_133/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_while_body_274_3880_frozen/strided_slice_172/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_while_body_274_3880_frozen/ExpandDims_26/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "mul", "op": "Mul", "input": ["placeholder", "placeholder_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Shape_1", "op": "Shape", "input": ["shape_c_mat_sn_0"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "mul_1", "op": "Mul", "input": ["mul_1_sum_10_0", "shape_c_mat_sn_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_113", "op": "Mul", "input": ["mul_1_sum_10_0", "mul_2_current_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_116", "op": "Mul", "input": ["__inference_while_body_274_3880_frozen/mul_115/x:output:0", "mul_2_current_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims_25", "op": "ExpandDims", "input": ["expanddims_1_add_8_0", "__inference_while_body_274_3880_frozen/strided_slice_193/stack_1/0:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "ExpandDims_24", "op": "ExpandDims", "input": ["expanddims_add_7_0", "__inference_while_body_274_3880_frozen/strided_slice_193/stack_1/0:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "strided_slice_174", "op": "StridedSlice", "input": ["mul_1_sum_10_0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_1:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_2:output:0"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "3"}, "begin_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "strided_slice_11", "op": "StridedSlice", "input": ["shape_c_mat_sn_0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_1:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_2:output:0"], "attr": {"Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "strided_slice_178", "op": "StridedSlice", "input": ["strided_slice_10_sum_11_0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_1:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_2:output:0"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}}}, {"name": "add_84", "op": "AddV2", "input": ["__inference_while_body_274_3880_frozen/ExpandDims_26/dim:output:0", "while_loop_counter"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "strided_slice_1", "op": "StridedSlice", "input": ["Shape_1:output:0", "__inference_while_body_274_3880_frozen/strided_slice_169/stack:output:0", "__inference_while_body_274_3880_frozen/strided_slice_169/stack_1:output:0", "__inference_while_body_274_3880_frozen/strided_slice_169/stack:output:0"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}}}, {"name": "strided_slice_184", "op": "StridedSlice", "input": ["ExpandDims_25:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_1:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_2:output:0"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "3"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "truediv_55", "op": "RealDiv", "input": ["mul_113:z:0", "ExpandDims_24:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv", "op": "RealDiv", "input": ["mul_1:z:0", "ExpandDims_24:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_175", "op": "StridedSlice", "input": ["ExpandDims_24:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_1:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_2:output:0"], "attr": {"ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "3"}, "begin_mask": {"i": "1"}}}, {"name": "mul_7", "op": "Mul", "input": ["strided_slice_11:output:0", "strided_slice_178:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_20", "op": "Sub", "input": ["strided_slice_1:output:0", "__inference_while_body_274_3880_frozen/sub_170/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sub", "op": "Sub", "input": ["strided_slice_1:output:0", "__inference_while_body_274_3880_frozen/ExpandDims_26/dim:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "mul_3", "op": "Mul", "input": ["shape_c_mat_sn_0", "truediv_55:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_14", "op": "StridedSlice", "input": ["truediv:z:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_1:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_2:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "3"}, "begin_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "truediv_56", "op": "RealDiv", "input": ["strided_slice_174:output:0", "strided_slice_175:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_25/stack_1", "op": "Pack", "input": ["__inference_while_body_274_3880_frozen/strided_slice_193/stack_1/0:output:0", "sub_20:z:0"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "add_7", "op": "AddV2", "input": ["__inference_while_body_274_3880_frozen/ExpandDims_26/dim:output:0", "sub_20:z:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "strided_slice_3/stack_1", "op": "Pack", "input": ["__inference_while_body_274_3880_frozen/strided_slice_193/stack_1/0:output:0", "sub:z:0"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "add_1", "op": "AddV2", "input": ["__inference_while_body_274_3880_frozen/ExpandDims_26/dim:output:0", "sub:z:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "strided_slice_4", "op": "StridedSlice", "input": ["mul_3:z:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_1:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_2:output:0"], "attr": {"ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_2", "op": "StridedSlice", "input": ["mul_3:z:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_1:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_2:output:0"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_27/stack_1", "op": "Pack", "input": ["__inference_while_body_274_3880_frozen/strided_slice_193/stack_1/0:output:0", "add_7:z:0"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "strided_slice_3", "op": "StridedSlice", "input": ["mul_3:z:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack:output:0", "strided_slice_3/stack_1:output:0", "__inference_while_body_274_3880_frozen/strided_slice_172/stack_2:output:0"], "attr": {"Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}}}, {"name": "strided_slice_15", "op": "StridedSlice", "input": ["truediv:z:0", 